bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/pds_reg.h
/**
  ******************************************************************************
  * @file    pds_reg.h
  * @version V1.0
  * @date    2022-07-01
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef  __PDS_REG_H__
#define  __PDS_REG_H__

#include "bl702l.h"

/* 0x0 : PDS_CTL */
#define PDS_CTL_OFFSET                                          (0x0)
#define PDS_START_PS                                            PDS_START_PS
#define PDS_START_PS_POS                                        (0U)
#define PDS_START_PS_LEN                                        (1U)
#define PDS_START_PS_MSK                                        (((1U<<PDS_START_PS_LEN)-1)<<PDS_START_PS_POS)
#define PDS_START_PS_UMSK                                       (~(((1U<<PDS_START_PS_LEN)-1)<<PDS_START_PS_POS))
#define PDS_CR_SLEEP_FOREVER                                    PDS_CR_SLEEP_FOREVER
#define PDS_CR_SLEEP_FOREVER_POS                                (1U)
#define PDS_CR_SLEEP_FOREVER_LEN                                (1U)
#define PDS_CR_SLEEP_FOREVER_MSK                                (((1U<<PDS_CR_SLEEP_FOREVER_LEN)-1)<<PDS_CR_SLEEP_FOREVER_POS)
#define PDS_CR_SLEEP_FOREVER_UMSK                               (~(((1U<<PDS_CR_SLEEP_FOREVER_LEN)-1)<<PDS_CR_SLEEP_FOREVER_POS))
#define PDS_CR_PDS_WAIT_RC32M_RDY                               PDS_CR_PDS_WAIT_RC32M_RDY
#define PDS_CR_PDS_WAIT_RC32M_RDY_POS                           (3U)
#define PDS_CR_PDS_WAIT_RC32M_RDY_LEN                           (1U)
#define PDS_CR_PDS_WAIT_RC32M_RDY_MSK                           (((1U<<PDS_CR_PDS_WAIT_RC32M_RDY_LEN)-1)<<PDS_CR_PDS_WAIT_RC32M_RDY_POS)
#define PDS_CR_PDS_WAIT_RC32M_RDY_UMSK                          (~(((1U<<PDS_CR_PDS_WAIT_RC32M_RDY_LEN)-1)<<PDS_CR_PDS_WAIT_RC32M_RDY_POS))
#define PDS_CR_PDS_PD_AVDD14                                    PDS_CR_PDS_PD_AVDD14
#define PDS_CR_PDS_PD_AVDD14_POS                                (4U)
#define PDS_CR_PDS_PD_AVDD14_LEN                                (1U)
#define PDS_CR_PDS_PD_AVDD14_MSK                                (((1U<<PDS_CR_PDS_PD_AVDD14_LEN)-1)<<PDS_CR_PDS_PD_AVDD14_POS)
#define PDS_CR_PDS_PD_AVDD14_UMSK                               (~(((1U<<PDS_CR_PDS_PD_AVDD14_LEN)-1)<<PDS_CR_PDS_PD_AVDD14_POS))
#define PDS_CR_PDS_PD_BG_SYS                                    PDS_CR_PDS_PD_BG_SYS
#define PDS_CR_PDS_PD_BG_SYS_POS                                (5U)
#define PDS_CR_PDS_PD_BG_SYS_LEN                                (1U)
#define PDS_CR_PDS_PD_BG_SYS_MSK                                (((1U<<PDS_CR_PDS_PD_BG_SYS_LEN)-1)<<PDS_CR_PDS_PD_BG_SYS_POS)
#define PDS_CR_PDS_PD_BG_SYS_UMSK                               (~(((1U<<PDS_CR_PDS_PD_BG_SYS_LEN)-1)<<PDS_CR_PDS_PD_BG_SYS_POS))
#define PDS_CR_PDS_GLB_REG_RESET_PROTECT                        PDS_CR_PDS_GLB_REG_RESET_PROTECT
#define PDS_CR_PDS_GLB_REG_RESET_PROTECT_POS                    (6U)
#define PDS_CR_PDS_GLB_REG_RESET_PROTECT_LEN                    (1U)
#define PDS_CR_PDS_GLB_REG_RESET_PROTECT_MSK                    (((1U<<PDS_CR_PDS_GLB_REG_RESET_PROTECT_LEN)-1)<<PDS_CR_PDS_GLB_REG_RESET_PROTECT_POS)
#define PDS_CR_PDS_GLB_REG_RESET_PROTECT_UMSK                   (~(((1U<<PDS_CR_PDS_GLB_REG_RESET_PROTECT_LEN)-1)<<PDS_CR_PDS_GLB_REG_RESET_PROTECT_POS))
#define PDS_CR_PDS_CTRL_PU_FLASH                                PDS_CR_PDS_CTRL_PU_FLASH
#define PDS_CR_PDS_CTRL_PU_FLASH_POS                            (7U)
#define PDS_CR_PDS_CTRL_PU_FLASH_LEN                            (1U)
#define PDS_CR_PDS_CTRL_PU_FLASH_MSK                            (((1U<<PDS_CR_PDS_CTRL_PU_FLASH_LEN)-1)<<PDS_CR_PDS_CTRL_PU_FLASH_POS)
#define PDS_CR_PDS_CTRL_PU_FLASH_UMSK                           (~(((1U<<PDS_CR_PDS_CTRL_PU_FLASH_LEN)-1)<<PDS_CR_PDS_CTRL_PU_FLASH_POS))
#define PDS_CR_PDS_GATE_CLK                                     PDS_CR_PDS_GATE_CLK
#define PDS_CR_PDS_GATE_CLK_POS                                 (8U)
#define PDS_CR_PDS_GATE_CLK_LEN                                 (1U)
#define PDS_CR_PDS_GATE_CLK_MSK                                 (((1U<<PDS_CR_PDS_GATE_CLK_LEN)-1)<<PDS_CR_PDS_GATE_CLK_POS)
#define PDS_CR_PDS_GATE_CLK_UMSK                                (~(((1U<<PDS_CR_PDS_GATE_CLK_LEN)-1)<<PDS_CR_PDS_GATE_CLK_POS))
#define PDS_CR_PDS_MEM_STBY                                     PDS_CR_PDS_MEM_STBY
#define PDS_CR_PDS_MEM_STBY_POS                                 (9U)
#define PDS_CR_PDS_MEM_STBY_LEN                                 (1U)
#define PDS_CR_PDS_MEM_STBY_MSK                                 (((1U<<PDS_CR_PDS_MEM_STBY_LEN)-1)<<PDS_CR_PDS_MEM_STBY_POS)
#define PDS_CR_PDS_MEM_STBY_UMSK                                (~(((1U<<PDS_CR_PDS_MEM_STBY_LEN)-1)<<PDS_CR_PDS_MEM_STBY_POS))
#define PDS_CR_SW_PU_FLASH                                      PDS_CR_SW_PU_FLASH
#define PDS_CR_SW_PU_FLASH_POS                                  (10U)
#define PDS_CR_SW_PU_FLASH_LEN                                  (1U)
#define PDS_CR_SW_PU_FLASH_MSK                                  (((1U<<PDS_CR_SW_PU_FLASH_LEN)-1)<<PDS_CR_SW_PU_FLASH_POS)
#define PDS_CR_SW_PU_FLASH_UMSK                                 (~(((1U<<PDS_CR_SW_PU_FLASH_LEN)-1)<<PDS_CR_SW_PU_FLASH_POS))
#define PDS_CR_PDS_ISO_EN                                       PDS_CR_PDS_ISO_EN
#define PDS_CR_PDS_ISO_EN_POS                                   (11U)
#define PDS_CR_PDS_ISO_EN_LEN                                   (1U)
#define PDS_CR_PDS_ISO_EN_MSK                                   (((1U<<PDS_CR_PDS_ISO_EN_LEN)-1)<<PDS_CR_PDS_ISO_EN_POS)
#define PDS_CR_PDS_ISO_EN_UMSK                                  (~(((1U<<PDS_CR_PDS_ISO_EN_LEN)-1)<<PDS_CR_PDS_ISO_EN_POS))
#define PDS_CR_PDS_WAIT_XTAL_RDY                                PDS_CR_PDS_WAIT_XTAL_RDY
#define PDS_CR_PDS_WAIT_XTAL_RDY_POS                            (12U)
#define PDS_CR_PDS_WAIT_XTAL_RDY_LEN                            (1U)
#define PDS_CR_PDS_WAIT_XTAL_RDY_MSK                            (((1U<<PDS_CR_PDS_WAIT_XTAL_RDY_LEN)-1)<<PDS_CR_PDS_WAIT_XTAL_RDY_POS)
#define PDS_CR_PDS_WAIT_XTAL_RDY_UMSK                           (~(((1U<<PDS_CR_PDS_WAIT_XTAL_RDY_LEN)-1)<<PDS_CR_PDS_WAIT_XTAL_RDY_POS))
#define PDS_CR_PDS_PWR_OFF                                      PDS_CR_PDS_PWR_OFF
#define PDS_CR_PDS_PWR_OFF_POS                                  (13U)
#define PDS_CR_PDS_PWR_OFF_LEN                                  (1U)
#define PDS_CR_PDS_PWR_OFF_MSK                                  (((1U<<PDS_CR_PDS_PWR_OFF_LEN)-1)<<PDS_CR_PDS_PWR_OFF_POS)
#define PDS_CR_PDS_PWR_OFF_UMSK                                 (~(((1U<<PDS_CR_PDS_PWR_OFF_LEN)-1)<<PDS_CR_PDS_PWR_OFF_POS))
#define PDS_CR_PDS_PD_XTAL                                      PDS_CR_PDS_PD_XTAL
#define PDS_CR_PDS_PD_XTAL_POS                                  (14U)
#define PDS_CR_PDS_PD_XTAL_LEN                                  (1U)
#define PDS_CR_PDS_PD_XTAL_MSK                                  (((1U<<PDS_CR_PDS_PD_XTAL_LEN)-1)<<PDS_CR_PDS_PD_XTAL_POS)
#define PDS_CR_PDS_PD_XTAL_UMSK                                 (~(((1U<<PDS_CR_PDS_PD_XTAL_LEN)-1)<<PDS_CR_PDS_PD_XTAL_POS))
#define PDS_CR_PDS_CTRL_SOC_ENB                                 PDS_CR_PDS_CTRL_SOC_ENB
#define PDS_CR_PDS_CTRL_SOC_ENB_POS                             (15U)
#define PDS_CR_PDS_CTRL_SOC_ENB_LEN                             (1U)
#define PDS_CR_PDS_CTRL_SOC_ENB_MSK                             (((1U<<PDS_CR_PDS_CTRL_SOC_ENB_LEN)-1)<<PDS_CR_PDS_CTRL_SOC_ENB_POS)
#define PDS_CR_PDS_CTRL_SOC_ENB_UMSK                            (~(((1U<<PDS_CR_PDS_CTRL_SOC_ENB_LEN)-1)<<PDS_CR_PDS_CTRL_SOC_ENB_POS))
#define PDS_CR_PDS_RST_SOC_EN                                   PDS_CR_PDS_RST_SOC_EN
#define PDS_CR_PDS_RST_SOC_EN_POS                               (16U)
#define PDS_CR_PDS_RST_SOC_EN_LEN                               (1U)
#define PDS_CR_PDS_RST_SOC_EN_MSK                               (((1U<<PDS_CR_PDS_RST_SOC_EN_LEN)-1)<<PDS_CR_PDS_RST_SOC_EN_POS)
#define PDS_CR_PDS_RST_SOC_EN_UMSK                              (~(((1U<<PDS_CR_PDS_RST_SOC_EN_LEN)-1)<<PDS_CR_PDS_RST_SOC_EN_POS))
#define PDS_CR_PDS_RC32M_OFF_DIS                                PDS_CR_PDS_RC32M_OFF_DIS
#define PDS_CR_PDS_RC32M_OFF_DIS_POS                            (17U)
#define PDS_CR_PDS_RC32M_OFF_DIS_LEN                            (1U)
#define PDS_CR_PDS_RC32M_OFF_DIS_MSK                            (((1U<<PDS_CR_PDS_RC32M_OFF_DIS_LEN)-1)<<PDS_CR_PDS_RC32M_OFF_DIS_POS)
#define PDS_CR_PDS_RC32M_OFF_DIS_UMSK                           (~(((1U<<PDS_CR_PDS_RC32M_OFF_DIS_LEN)-1)<<PDS_CR_PDS_RC32M_OFF_DIS_POS))
#define PDS_CR_PDS_LDO_VSEL_EN                                  PDS_CR_PDS_LDO_VSEL_EN
#define PDS_CR_PDS_LDO_VSEL_EN_POS                              (18U)
#define PDS_CR_PDS_LDO_VSEL_EN_LEN                              (1U)
#define PDS_CR_PDS_LDO_VSEL_EN_MSK                              (((1U<<PDS_CR_PDS_LDO_VSEL_EN_LEN)-1)<<PDS_CR_PDS_LDO_VSEL_EN_POS)
#define PDS_CR_PDS_LDO_VSEL_EN_UMSK                             (~(((1U<<PDS_CR_PDS_LDO_VSEL_EN_LEN)-1)<<PDS_CR_PDS_LDO_VSEL_EN_POS))
#define PDS_CR_PDS_XTAL_CNT_RC32K_EN                            PDS_CR_PDS_XTAL_CNT_RC32K_EN
#define PDS_CR_PDS_XTAL_CNT_RC32K_EN_POS                        (20U)
#define PDS_CR_PDS_XTAL_CNT_RC32K_EN_LEN                        (1U)
#define PDS_CR_PDS_XTAL_CNT_RC32K_EN_MSK                        (((1U<<PDS_CR_PDS_XTAL_CNT_RC32K_EN_LEN)-1)<<PDS_CR_PDS_XTAL_CNT_RC32K_EN_POS)
#define PDS_CR_PDS_XTAL_CNT_RC32K_EN_UMSK                       (~(((1U<<PDS_CR_PDS_XTAL_CNT_RC32K_EN_LEN)-1)<<PDS_CR_PDS_XTAL_CNT_RC32K_EN_POS))
#define PDS_CR_NP_WFI_MASK                                      PDS_CR_NP_WFI_MASK
#define PDS_CR_NP_WFI_MASK_POS                                  (21U)
#define PDS_CR_NP_WFI_MASK_LEN                                  (1U)
#define PDS_CR_NP_WFI_MASK_MSK                                  (((1U<<PDS_CR_NP_WFI_MASK_LEN)-1)<<PDS_CR_NP_WFI_MASK_POS)
#define PDS_CR_NP_WFI_MASK_UMSK                                 (~(((1U<<PDS_CR_NP_WFI_MASK_LEN)-1)<<PDS_CR_NP_WFI_MASK_POS))
#define PDS_CR_PDS_PD_LDO11                                     PDS_CR_PDS_PD_LDO11
#define PDS_CR_PDS_PD_LDO11_POS                                 (22U)
#define PDS_CR_PDS_PD_LDO11_LEN                                 (1U)
#define PDS_CR_PDS_PD_LDO11_MSK                                 (((1U<<PDS_CR_PDS_PD_LDO11_LEN)-1)<<PDS_CR_PDS_PD_LDO11_POS)
#define PDS_CR_PDS_PD_LDO11_UMSK                                (~(((1U<<PDS_CR_PDS_PD_LDO11_LEN)-1)<<PDS_CR_PDS_PD_LDO11_POS))
#define PDS_CR_PDS_CTRL_RF                                      PDS_CR_PDS_CTRL_RF
#define PDS_CR_PDS_CTRL_RF_POS                                  (23U)
#define PDS_CR_PDS_CTRL_RF_LEN                                  (1U)
#define PDS_CR_PDS_CTRL_RF_MSK                                  (((1U<<PDS_CR_PDS_CTRL_RF_LEN)-1)<<PDS_CR_PDS_CTRL_RF_POS)
#define PDS_CR_PDS_CTRL_RF_UMSK                                 (~(((1U<<PDS_CR_PDS_CTRL_RF_LEN)-1)<<PDS_CR_PDS_CTRL_RF_POS))
#define PDS_CFG_XTAL_DEG_EN                                     PDS_CFG_XTAL_DEG_EN
#define PDS_CFG_XTAL_DEG_EN_POS                                 (24U)
#define PDS_CFG_XTAL_DEG_EN_LEN                                 (1U)
#define PDS_CFG_XTAL_DEG_EN_MSK                                 (((1U<<PDS_CFG_XTAL_DEG_EN_LEN)-1)<<PDS_CFG_XTAL_DEG_EN_POS)
#define PDS_CFG_XTAL_DEG_EN_UMSK                                (~(((1U<<PDS_CFG_XTAL_DEG_EN_LEN)-1)<<PDS_CFG_XTAL_DEG_EN_POS))
#define PDS_CFG_BLE_WAKEUP_REQ_AFTER_PDS                        PDS_CFG_BLE_WAKEUP_REQ_AFTER_PDS
#define PDS_CFG_BLE_WAKEUP_REQ_AFTER_PDS_POS                    (25U)
#define PDS_CFG_BLE_WAKEUP_REQ_AFTER_PDS_LEN                    (1U)
#define PDS_CFG_BLE_WAKEUP_REQ_AFTER_PDS_MSK                    (((1U<<PDS_CFG_BLE_WAKEUP_REQ_AFTER_PDS_LEN)-1)<<PDS_CFG_BLE_WAKEUP_REQ_AFTER_PDS_POS)
#define PDS_CFG_BLE_WAKEUP_REQ_AFTER_PDS_UMSK                   (~(((1U<<PDS_CFG_BLE_WAKEUP_REQ_AFTER_PDS_LEN)-1)<<PDS_CFG_BLE_WAKEUP_REQ_AFTER_PDS_POS))
#define PDS_CR_SW_GPIO_ISO_MODE                                 PDS_CR_SW_GPIO_ISO_MODE
#define PDS_CR_SW_GPIO_ISO_MODE_POS                             (26U)
#define PDS_CR_SW_GPIO_ISO_MODE_LEN                             (1U)
#define PDS_CR_SW_GPIO_ISO_MODE_MSK                             (((1U<<PDS_CR_SW_GPIO_ISO_MODE_LEN)-1)<<PDS_CR_SW_GPIO_ISO_MODE_POS)
#define PDS_CR_SW_GPIO_ISO_MODE_UMSK                            (~(((1U<<PDS_CR_SW_GPIO_ISO_MODE_LEN)-1)<<PDS_CR_SW_GPIO_ISO_MODE_POS))
#define PDS_CR_TURN_OFF_PDS_CLK                                 PDS_CR_TURN_OFF_PDS_CLK
#define PDS_CR_TURN_OFF_PDS_CLK_POS                             (27U)
#define PDS_CR_TURN_OFF_PDS_CLK_LEN                             (1U)
#define PDS_CR_TURN_OFF_PDS_CLK_MSK                             (((1U<<PDS_CR_TURN_OFF_PDS_CLK_LEN)-1)<<PDS_CR_TURN_OFF_PDS_CLK_POS)
#define PDS_CR_TURN_OFF_PDS_CLK_UMSK                            (~(((1U<<PDS_CR_TURN_OFF_PDS_CLK_LEN)-1)<<PDS_CR_TURN_OFF_PDS_CLK_POS))
#define PDS_CR_PDS_GPIO_KEEP_EN                                 PDS_CR_PDS_GPIO_KEEP_EN
#define PDS_CR_PDS_GPIO_KEEP_EN_POS                             (28U)
#define PDS_CR_PDS_GPIO_KEEP_EN_LEN                             (3U)
#define PDS_CR_PDS_GPIO_KEEP_EN_MSK                             (((1U<<PDS_CR_PDS_GPIO_KEEP_EN_LEN)-1)<<PDS_CR_PDS_GPIO_KEEP_EN_POS)
#define PDS_CR_PDS_GPIO_KEEP_EN_UMSK                            (~(((1U<<PDS_CR_PDS_GPIO_KEEP_EN_LEN)-1)<<PDS_CR_PDS_GPIO_KEEP_EN_POS))
#define PDS_CR_PDS_GPIO_ISO_MODE                                PDS_CR_PDS_GPIO_ISO_MODE
#define PDS_CR_PDS_GPIO_ISO_MODE_POS                            (31U)
#define PDS_CR_PDS_GPIO_ISO_MODE_LEN                            (1U)
#define PDS_CR_PDS_GPIO_ISO_MODE_MSK                            (((1U<<PDS_CR_PDS_GPIO_ISO_MODE_LEN)-1)<<PDS_CR_PDS_GPIO_ISO_MODE_POS)
#define PDS_CR_PDS_GPIO_ISO_MODE_UMSK                           (~(((1U<<PDS_CR_PDS_GPIO_ISO_MODE_LEN)-1)<<PDS_CR_PDS_GPIO_ISO_MODE_POS))

/* 0xC : PDS_INT */
#define PDS_INT_OFFSET                                          (0xC)
#define PDS_RO_PDS_WAKE_INT                                     PDS_RO_PDS_WAKE_INT
#define PDS_RO_PDS_WAKE_INT_POS                                 (0U)
#define PDS_RO_PDS_WAKE_INT_LEN                                 (1U)
#define PDS_RO_PDS_WAKE_INT_MSK                                 (((1U<<PDS_RO_PDS_WAKE_INT_LEN)-1)<<PDS_RO_PDS_WAKE_INT_POS)
#define PDS_RO_PDS_WAKE_INT_UMSK                                (~(((1U<<PDS_RO_PDS_WAKE_INT_LEN)-1)<<PDS_RO_PDS_WAKE_INT_POS))
#define PDS_RO_PDS_RF_DONE_INT                                  PDS_RO_PDS_RF_DONE_INT
#define PDS_RO_PDS_RF_DONE_INT_POS                              (2U)
#define PDS_RO_PDS_RF_DONE_INT_LEN                              (1U)
#define PDS_RO_PDS_RF_DONE_INT_MSK                              (((1U<<PDS_RO_PDS_RF_DONE_INT_LEN)-1)<<PDS_RO_PDS_RF_DONE_INT_POS)
#define PDS_RO_PDS_RF_DONE_INT_UMSK                             (~(((1U<<PDS_RO_PDS_RF_DONE_INT_LEN)-1)<<PDS_RO_PDS_RF_DONE_INT_POS))
#define PDS_RESET_EVENT                                         PDS_RESET_EVENT
#define PDS_RESET_EVENT_POS                                     (4U)
#define PDS_RESET_EVENT_LEN                                     (3U)
#define PDS_RESET_EVENT_MSK                                     (((1U<<PDS_RESET_EVENT_LEN)-1)<<PDS_RESET_EVENT_POS)
#define PDS_RESET_EVENT_UMSK                                    (~(((1U<<PDS_RESET_EVENT_LEN)-1)<<PDS_RESET_EVENT_POS))
#define PDS_CLR_RESET_EVENT                                     PDS_CLR_RESET_EVENT
#define PDS_CLR_RESET_EVENT_POS                                 (7U)
#define PDS_CLR_RESET_EVENT_LEN                                 (1U)
#define PDS_CLR_RESET_EVENT_MSK                                 (((1U<<PDS_CLR_RESET_EVENT_LEN)-1)<<PDS_CLR_RESET_EVENT_POS)
#define PDS_CLR_RESET_EVENT_UMSK                                (~(((1U<<PDS_CLR_RESET_EVENT_LEN)-1)<<PDS_CLR_RESET_EVENT_POS))
#define PDS_CR_PDS_WAKE_INT_MASK                                PDS_CR_PDS_WAKE_INT_MASK
#define PDS_CR_PDS_WAKE_INT_MASK_POS                            (8U)
#define PDS_CR_PDS_WAKE_INT_MASK_LEN                            (1U)
#define PDS_CR_PDS_WAKE_INT_MASK_MSK                            (((1U<<PDS_CR_PDS_WAKE_INT_MASK_LEN)-1)<<PDS_CR_PDS_WAKE_INT_MASK_POS)
#define PDS_CR_PDS_WAKE_INT_MASK_UMSK                           (~(((1U<<PDS_CR_PDS_WAKE_INT_MASK_LEN)-1)<<PDS_CR_PDS_WAKE_INT_MASK_POS))
#define PDS_PIN_WAKEUP_OPTION                                   PDS_PIN_WAKEUP_OPTION
#define PDS_PIN_WAKEUP_OPTION_POS                               (9U)
#define PDS_PIN_WAKEUP_OPTION_LEN                               (1U)
#define PDS_PIN_WAKEUP_OPTION_MSK                               (((1U<<PDS_PIN_WAKEUP_OPTION_LEN)-1)<<PDS_PIN_WAKEUP_OPTION_POS)
#define PDS_PIN_WAKEUP_OPTION_UMSK                              (~(((1U<<PDS_PIN_WAKEUP_OPTION_LEN)-1)<<PDS_PIN_WAKEUP_OPTION_POS))
#define PDS_CR_PDS_RF_DONE_INT_MASK                             PDS_CR_PDS_RF_DONE_INT_MASK
#define PDS_CR_PDS_RF_DONE_INT_MASK_POS                         (10U)
#define PDS_CR_PDS_RF_DONE_INT_MASK_LEN                         (1U)
#define PDS_CR_PDS_RF_DONE_INT_MASK_MSK                         (((1U<<PDS_CR_PDS_RF_DONE_INT_MASK_LEN)-1)<<PDS_CR_PDS_RF_DONE_INT_MASK_POS)
#define PDS_CR_PDS_RF_DONE_INT_MASK_UMSK                        (~(((1U<<PDS_CR_PDS_RF_DONE_INT_MASK_LEN)-1)<<PDS_CR_PDS_RF_DONE_INT_MASK_POS))
#define PDS_TIMEOUT_EVENT                                       PDS_TIMEOUT_EVENT
#define PDS_TIMEOUT_EVENT_POS                                   (11U)
#define PDS_TIMEOUT_EVENT_LEN                                   (3U)
#define PDS_TIMEOUT_EVENT_MSK                                   (((1U<<PDS_TIMEOUT_EVENT_LEN)-1)<<PDS_TIMEOUT_EVENT_POS)
#define PDS_TIMEOUT_EVENT_UMSK                                  (~(((1U<<PDS_TIMEOUT_EVENT_LEN)-1)<<PDS_TIMEOUT_EVENT_POS))
#define PDS_EN_PDS_TIMEOUT_EVENT                                PDS_EN_PDS_TIMEOUT_EVENT
#define PDS_EN_PDS_TIMEOUT_EVENT_POS                            (14U)
#define PDS_EN_PDS_TIMEOUT_EVENT_LEN                            (1U)
#define PDS_EN_PDS_TIMEOUT_EVENT_MSK                            (((1U<<PDS_EN_PDS_TIMEOUT_EVENT_LEN)-1)<<PDS_EN_PDS_TIMEOUT_EVENT_POS)
#define PDS_EN_PDS_TIMEOUT_EVENT_UMSK                           (~(((1U<<PDS_EN_PDS_TIMEOUT_EVENT_LEN)-1)<<PDS_EN_PDS_TIMEOUT_EVENT_POS))
#define PDS_CR_PDS_INT_CLR                                      PDS_CR_PDS_INT_CLR
#define PDS_CR_PDS_INT_CLR_POS                                  (15U)
#define PDS_CR_PDS_INT_CLR_LEN                                  (1U)
#define PDS_CR_PDS_INT_CLR_MSK                                  (((1U<<PDS_CR_PDS_INT_CLR_LEN)-1)<<PDS_CR_PDS_INT_CLR_POS)
#define PDS_CR_PDS_INT_CLR_UMSK                                 (~(((1U<<PDS_CR_PDS_INT_CLR_LEN)-1)<<PDS_CR_PDS_INT_CLR_POS))
#define PDS_CR_PDS_WAKEUP_SRC_EN                                PDS_CR_PDS_WAKEUP_SRC_EN
#define PDS_CR_PDS_WAKEUP_SRC_EN_POS                            (17U)
#define PDS_CR_PDS_WAKEUP_SRC_EN_LEN                            (7U)
#define PDS_CR_PDS_WAKEUP_SRC_EN_MSK                            (((1U<<PDS_CR_PDS_WAKEUP_SRC_EN_LEN)-1)<<PDS_CR_PDS_WAKEUP_SRC_EN_POS)
#define PDS_CR_PDS_WAKEUP_SRC_EN_UMSK                           (~(((1U<<PDS_CR_PDS_WAKEUP_SRC_EN_LEN)-1)<<PDS_CR_PDS_WAKEUP_SRC_EN_POS))
#define PDS_RO_PDS_WAKEUP_EVENT                                 PDS_RO_PDS_WAKEUP_EVENT
#define PDS_RO_PDS_WAKEUP_EVENT_POS                             (25U)
#define PDS_RO_PDS_WAKEUP_EVENT_LEN                             (7U)
#define PDS_RO_PDS_WAKEUP_EVENT_MSK                             (((1U<<PDS_RO_PDS_WAKEUP_EVENT_LEN)-1)<<PDS_RO_PDS_WAKEUP_EVENT_POS)
#define PDS_RO_PDS_WAKEUP_EVENT_UMSK                            (~(((1U<<PDS_RO_PDS_WAKEUP_EVENT_LEN)-1)<<PDS_RO_PDS_WAKEUP_EVENT_POS))

/* 0x10 : PDS_CTL2 */
#define PDS_CTL2_OFFSET                                         (0x10)
#define PDS_CR_PDS_FORCE_NP_PDS_RST                             PDS_CR_PDS_FORCE_NP_PDS_RST
#define PDS_CR_PDS_FORCE_NP_PDS_RST_POS                         (8U)
#define PDS_CR_PDS_FORCE_NP_PDS_RST_LEN                         (1U)
#define PDS_CR_PDS_FORCE_NP_PDS_RST_MSK                         (((1U<<PDS_CR_PDS_FORCE_NP_PDS_RST_LEN)-1)<<PDS_CR_PDS_FORCE_NP_PDS_RST_POS)
#define PDS_CR_PDS_FORCE_NP_PDS_RST_UMSK                        (~(((1U<<PDS_CR_PDS_FORCE_NP_PDS_RST_LEN)-1)<<PDS_CR_PDS_FORCE_NP_PDS_RST_POS))
#define PDS_CR_PDS_FORCE_BZ_PDS_RST                             PDS_CR_PDS_FORCE_BZ_PDS_RST
#define PDS_CR_PDS_FORCE_BZ_PDS_RST_POS                         (10U)
#define PDS_CR_PDS_FORCE_BZ_PDS_RST_LEN                         (1U)
#define PDS_CR_PDS_FORCE_BZ_PDS_RST_MSK                         (((1U<<PDS_CR_PDS_FORCE_BZ_PDS_RST_LEN)-1)<<PDS_CR_PDS_FORCE_BZ_PDS_RST_POS)
#define PDS_CR_PDS_FORCE_BZ_PDS_RST_UMSK                        (~(((1U<<PDS_CR_PDS_FORCE_BZ_PDS_RST_LEN)-1)<<PDS_CR_PDS_FORCE_BZ_PDS_RST_POS))
#define PDS_CR_PDS_FORCE_NP_GATE_CLK                            PDS_CR_PDS_FORCE_NP_GATE_CLK
#define PDS_CR_PDS_FORCE_NP_GATE_CLK_POS                        (16U)
#define PDS_CR_PDS_FORCE_NP_GATE_CLK_LEN                        (1U)
#define PDS_CR_PDS_FORCE_NP_GATE_CLK_MSK                        (((1U<<PDS_CR_PDS_FORCE_NP_GATE_CLK_LEN)-1)<<PDS_CR_PDS_FORCE_NP_GATE_CLK_POS)
#define PDS_CR_PDS_FORCE_NP_GATE_CLK_UMSK                       (~(((1U<<PDS_CR_PDS_FORCE_NP_GATE_CLK_LEN)-1)<<PDS_CR_PDS_FORCE_NP_GATE_CLK_POS))
#define PDS_CR_PDS_FORCE_BZ_GATE_CLK                            PDS_CR_PDS_FORCE_BZ_GATE_CLK
#define PDS_CR_PDS_FORCE_BZ_GATE_CLK_POS                        (18U)
#define PDS_CR_PDS_FORCE_BZ_GATE_CLK_LEN                        (1U)
#define PDS_CR_PDS_FORCE_BZ_GATE_CLK_MSK                        (((1U<<PDS_CR_PDS_FORCE_BZ_GATE_CLK_LEN)-1)<<PDS_CR_PDS_FORCE_BZ_GATE_CLK_POS)
#define PDS_CR_PDS_FORCE_BZ_GATE_CLK_UMSK                       (~(((1U<<PDS_CR_PDS_FORCE_BZ_GATE_CLK_LEN)-1)<<PDS_CR_PDS_FORCE_BZ_GATE_CLK_POS))

