bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/pds_reg.h
/* 0x14 : PDS_CTL3 */
#define PDS_CTL3_OFFSET                                         (0x14)
#define PDS_CR_PDS_FORCE_MISC_PWR_OFF                           PDS_CR_PDS_FORCE_MISC_PWR_OFF
#define PDS_CR_PDS_FORCE_MISC_PWR_OFF_POS                       (1U)
#define PDS_CR_PDS_FORCE_MISC_PWR_OFF_LEN                       (1U)
#define PDS_CR_PDS_FORCE_MISC_PWR_OFF_MSK                       (((1U<<PDS_CR_PDS_FORCE_MISC_PWR_OFF_LEN)-1)<<PDS_CR_PDS_FORCE_MISC_PWR_OFF_POS)
#define PDS_CR_PDS_FORCE_MISC_PWR_OFF_UMSK                      (~(((1U<<PDS_CR_PDS_FORCE_MISC_PWR_OFF_LEN)-1)<<PDS_CR_PDS_FORCE_MISC_PWR_OFF_POS))
#define PDS_CR_PDS_FORCE_MISC_PDS_RST                           PDS_CR_PDS_FORCE_MISC_PDS_RST
#define PDS_CR_PDS_FORCE_MISC_PDS_RST_POS                       (7U)
#define PDS_CR_PDS_FORCE_MISC_PDS_RST_LEN                       (1U)
#define PDS_CR_PDS_FORCE_MISC_PDS_RST_MSK                       (((1U<<PDS_CR_PDS_FORCE_MISC_PDS_RST_LEN)-1)<<PDS_CR_PDS_FORCE_MISC_PDS_RST_POS)
#define PDS_CR_PDS_FORCE_MISC_PDS_RST_UMSK                      (~(((1U<<PDS_CR_PDS_FORCE_MISC_PDS_RST_LEN)-1)<<PDS_CR_PDS_FORCE_MISC_PDS_RST_POS))
#define PDS_CR_PDS_FORCE_MISC_GATE_CLK                          PDS_CR_PDS_FORCE_MISC_GATE_CLK
#define PDS_CR_PDS_FORCE_MISC_GATE_CLK_POS                      (13U)
#define PDS_CR_PDS_FORCE_MISC_GATE_CLK_LEN                      (1U)
#define PDS_CR_PDS_FORCE_MISC_GATE_CLK_MSK                      (((1U<<PDS_CR_PDS_FORCE_MISC_GATE_CLK_LEN)-1)<<PDS_CR_PDS_FORCE_MISC_GATE_CLK_POS)
#define PDS_CR_PDS_FORCE_MISC_GATE_CLK_UMSK                     (~(((1U<<PDS_CR_PDS_FORCE_MISC_GATE_CLK_LEN)-1)<<PDS_CR_PDS_FORCE_MISC_GATE_CLK_POS))
#define PDS_CR_PDS_MISC_ISO_EN                                  PDS_CR_PDS_MISC_ISO_EN
#define PDS_CR_PDS_MISC_ISO_EN_POS                              (30U)
#define PDS_CR_PDS_MISC_ISO_EN_LEN                              (1U)
#define PDS_CR_PDS_MISC_ISO_EN_MSK                              (((1U<<PDS_CR_PDS_MISC_ISO_EN_LEN)-1)<<PDS_CR_PDS_MISC_ISO_EN_POS)
#define PDS_CR_PDS_MISC_ISO_EN_UMSK                             (~(((1U<<PDS_CR_PDS_MISC_ISO_EN_LEN)-1)<<PDS_CR_PDS_MISC_ISO_EN_POS))

/* 0x18 : PDS_CTL4 */
#define PDS_CTL4_OFFSET                                         (0x18)
#define PDS_CR_PDS_NP_RESET                                     PDS_CR_PDS_NP_RESET
#define PDS_CR_PDS_NP_RESET_POS                                 (1U)
#define PDS_CR_PDS_NP_RESET_LEN                                 (1U)
#define PDS_CR_PDS_NP_RESET_MSK                                 (((1U<<PDS_CR_PDS_NP_RESET_LEN)-1)<<PDS_CR_PDS_NP_RESET_POS)
#define PDS_CR_PDS_NP_RESET_UMSK                                (~(((1U<<PDS_CR_PDS_NP_RESET_LEN)-1)<<PDS_CR_PDS_NP_RESET_POS))
#define PDS_CR_PDS_NP_GATE_CLK                                  PDS_CR_PDS_NP_GATE_CLK
#define PDS_CR_PDS_NP_GATE_CLK_POS                              (3U)
#define PDS_CR_PDS_NP_GATE_CLK_LEN                              (1U)
#define PDS_CR_PDS_NP_GATE_CLK_MSK                              (((1U<<PDS_CR_PDS_NP_GATE_CLK_LEN)-1)<<PDS_CR_PDS_NP_GATE_CLK_POS)
#define PDS_CR_PDS_NP_GATE_CLK_UMSK                             (~(((1U<<PDS_CR_PDS_NP_GATE_CLK_LEN)-1)<<PDS_CR_PDS_NP_GATE_CLK_POS))
#define PDS_CR_PDS_BZ_RESET                                     PDS_CR_PDS_BZ_RESET
#define PDS_CR_PDS_BZ_RESET_POS                                 (13U)
#define PDS_CR_PDS_BZ_RESET_LEN                                 (1U)
#define PDS_CR_PDS_BZ_RESET_MSK                                 (((1U<<PDS_CR_PDS_BZ_RESET_LEN)-1)<<PDS_CR_PDS_BZ_RESET_POS)
#define PDS_CR_PDS_BZ_RESET_UMSK                                (~(((1U<<PDS_CR_PDS_BZ_RESET_LEN)-1)<<PDS_CR_PDS_BZ_RESET_POS))
#define PDS_CR_PDS_BZ_GATE_CLK                                  PDS_CR_PDS_BZ_GATE_CLK
#define PDS_CR_PDS_BZ_GATE_CLK_POS                              (15U)
#define PDS_CR_PDS_BZ_GATE_CLK_LEN                              (1U)
#define PDS_CR_PDS_BZ_GATE_CLK_MSK                              (((1U<<PDS_CR_PDS_BZ_GATE_CLK_LEN)-1)<<PDS_CR_PDS_BZ_GATE_CLK_POS)
#define PDS_CR_PDS_BZ_GATE_CLK_UMSK                             (~(((1U<<PDS_CR_PDS_BZ_GATE_CLK_LEN)-1)<<PDS_CR_PDS_BZ_GATE_CLK_POS))
#define PDS_CR_PDS_MISC_PWR_OFF                                 PDS_CR_PDS_MISC_PWR_OFF
#define PDS_CR_PDS_MISC_PWR_OFF_POS                             (24U)
#define PDS_CR_PDS_MISC_PWR_OFF_LEN                             (1U)
#define PDS_CR_PDS_MISC_PWR_OFF_MSK                             (((1U<<PDS_CR_PDS_MISC_PWR_OFF_LEN)-1)<<PDS_CR_PDS_MISC_PWR_OFF_POS)
#define PDS_CR_PDS_MISC_PWR_OFF_UMSK                            (~(((1U<<PDS_CR_PDS_MISC_PWR_OFF_LEN)-1)<<PDS_CR_PDS_MISC_PWR_OFF_POS))
#define PDS_CR_PDS_MISC_RESET                                   PDS_CR_PDS_MISC_RESET
#define PDS_CR_PDS_MISC_RESET_POS                               (25U)
#define PDS_CR_PDS_MISC_RESET_LEN                               (1U)
#define PDS_CR_PDS_MISC_RESET_MSK                               (((1U<<PDS_CR_PDS_MISC_RESET_LEN)-1)<<PDS_CR_PDS_MISC_RESET_POS)
#define PDS_CR_PDS_MISC_RESET_UMSK                              (~(((1U<<PDS_CR_PDS_MISC_RESET_LEN)-1)<<PDS_CR_PDS_MISC_RESET_POS))
#define PDS_CR_PDS_MISC_GATE_CLK                                PDS_CR_PDS_MISC_GATE_CLK
#define PDS_CR_PDS_MISC_GATE_CLK_POS                            (27U)
#define PDS_CR_PDS_MISC_GATE_CLK_LEN                            (1U)
#define PDS_CR_PDS_MISC_GATE_CLK_MSK                            (((1U<<PDS_CR_PDS_MISC_GATE_CLK_LEN)-1)<<PDS_CR_PDS_MISC_GATE_CLK_POS)
#define PDS_CR_PDS_MISC_GATE_CLK_UMSK                           (~(((1U<<PDS_CR_PDS_MISC_GATE_CLK_LEN)-1)<<PDS_CR_PDS_MISC_GATE_CLK_POS))

/* 0x1C : pds_stat */
#define PDS_STAT_OFFSET                                         (0x1C)
#define PDS_RO_PDS_STATE                                        PDS_RO_PDS_STATE
#define PDS_RO_PDS_STATE_POS                                    (0U)
#define PDS_RO_PDS_STATE_LEN                                    (5U)
#define PDS_RO_PDS_STATE_MSK                                    (((1U<<PDS_RO_PDS_STATE_LEN)-1)<<PDS_RO_PDS_STATE_POS)
#define PDS_RO_PDS_STATE_UMSK                                   (~(((1U<<PDS_RO_PDS_STATE_LEN)-1)<<PDS_RO_PDS_STATE_POS))
#define PDS_RO_PDS_RF_STATE                                     PDS_RO_PDS_RF_STATE
#define PDS_RO_PDS_RF_STATE_POS                                 (8U)
#define PDS_RO_PDS_RF_STATE_LEN                                 (3U)
#define PDS_RO_PDS_RF_STATE_MSK                                 (((1U<<PDS_RO_PDS_RF_STATE_LEN)-1)<<PDS_RO_PDS_RF_STATE_POS)
#define PDS_RO_PDS_RF_STATE_UMSK                                (~(((1U<<PDS_RO_PDS_RF_STATE_LEN)-1)<<PDS_RO_PDS_RF_STATE_POS))

/* 0x20 : pds_ram1 */
#define PDS_RAM1_OFFSET                                         (0x20)
#define PDS_CR_PDS_RAM_RET1N                                    PDS_CR_PDS_RAM_RET1N
#define PDS_CR_PDS_RAM_RET1N_POS                                (0U)
#define PDS_CR_PDS_RAM_RET1N_LEN                                (5U)
#define PDS_CR_PDS_RAM_RET1N_MSK                                (((1U<<PDS_CR_PDS_RAM_RET1N_LEN)-1)<<PDS_CR_PDS_RAM_RET1N_POS)
#define PDS_CR_PDS_RAM_RET1N_UMSK                               (~(((1U<<PDS_CR_PDS_RAM_RET1N_LEN)-1)<<PDS_CR_PDS_RAM_RET1N_POS))
#define PDS_CR_PDS_RAM_RET2N                                    PDS_CR_PDS_RAM_RET2N
#define PDS_CR_PDS_RAM_RET2N_POS                                (8U)
#define PDS_CR_PDS_RAM_RET2N_LEN                                (5U)
#define PDS_CR_PDS_RAM_RET2N_MSK                                (((1U<<PDS_CR_PDS_RAM_RET2N_LEN)-1)<<PDS_CR_PDS_RAM_RET2N_POS)
#define PDS_CR_PDS_RAM_RET2N_UMSK                               (~(((1U<<PDS_CR_PDS_RAM_RET2N_LEN)-1)<<PDS_CR_PDS_RAM_RET2N_POS))
#define PDS_CR_PDS_RAM_PGEN                                     PDS_CR_PDS_RAM_PGEN
#define PDS_CR_PDS_RAM_PGEN_POS                                 (16U)
#define PDS_CR_PDS_RAM_PGEN_LEN                                 (5U)
#define PDS_CR_PDS_RAM_PGEN_MSK                                 (((1U<<PDS_CR_PDS_RAM_PGEN_LEN)-1)<<PDS_CR_PDS_RAM_PGEN_POS)
#define PDS_CR_PDS_RAM_PGEN_UMSK                                (~(((1U<<PDS_CR_PDS_RAM_PGEN_LEN)-1)<<PDS_CR_PDS_RAM_PGEN_POS))

