bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/pds_reg.h
/* 0x30 : pds_gpio_pd_set */
#define PDS_GPIO_PD_SET_OFFSET                                  (0x30)
#define PDS_CR_PDS_GPIO0_PD                                     PDS_CR_PDS_GPIO0_PD
#define PDS_CR_PDS_GPIO0_PD_POS                                 (0U)
#define PDS_CR_PDS_GPIO0_PD_LEN                                 (1U)
#define PDS_CR_PDS_GPIO0_PD_MSK                                 (((1U<<PDS_CR_PDS_GPIO0_PD_LEN)-1)<<PDS_CR_PDS_GPIO0_PD_POS)
#define PDS_CR_PDS_GPIO0_PD_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO0_PD_LEN)-1)<<PDS_CR_PDS_GPIO0_PD_POS))
#define PDS_CR_PDS_GPIO1_PD                                     PDS_CR_PDS_GPIO1_PD
#define PDS_CR_PDS_GPIO1_PD_POS                                 (1U)
#define PDS_CR_PDS_GPIO1_PD_LEN                                 (1U)
#define PDS_CR_PDS_GPIO1_PD_MSK                                 (((1U<<PDS_CR_PDS_GPIO1_PD_LEN)-1)<<PDS_CR_PDS_GPIO1_PD_POS)
#define PDS_CR_PDS_GPIO1_PD_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO1_PD_LEN)-1)<<PDS_CR_PDS_GPIO1_PD_POS))
#define PDS_CR_PDS_GPIO2_PD                                     PDS_CR_PDS_GPIO2_PD
#define PDS_CR_PDS_GPIO2_PD_POS                                 (2U)
#define PDS_CR_PDS_GPIO2_PD_LEN                                 (1U)
#define PDS_CR_PDS_GPIO2_PD_MSK                                 (((1U<<PDS_CR_PDS_GPIO2_PD_LEN)-1)<<PDS_CR_PDS_GPIO2_PD_POS)
#define PDS_CR_PDS_GPIO2_PD_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO2_PD_LEN)-1)<<PDS_CR_PDS_GPIO2_PD_POS))
#define PDS_CR_PDS_GPIO3_PD                                     PDS_CR_PDS_GPIO3_PD
#define PDS_CR_PDS_GPIO3_PD_POS                                 (3U)
#define PDS_CR_PDS_GPIO3_PD_LEN                                 (1U)
#define PDS_CR_PDS_GPIO3_PD_MSK                                 (((1U<<PDS_CR_PDS_GPIO3_PD_LEN)-1)<<PDS_CR_PDS_GPIO3_PD_POS)
#define PDS_CR_PDS_GPIO3_PD_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO3_PD_LEN)-1)<<PDS_CR_PDS_GPIO3_PD_POS))
#define PDS_CR_PDS_GPIO4_PD                                     PDS_CR_PDS_GPIO4_PD
#define PDS_CR_PDS_GPIO4_PD_POS                                 (4U)
#define PDS_CR_PDS_GPIO4_PD_LEN                                 (1U)
#define PDS_CR_PDS_GPIO4_PD_MSK                                 (((1U<<PDS_CR_PDS_GPIO4_PD_LEN)-1)<<PDS_CR_PDS_GPIO4_PD_POS)
#define PDS_CR_PDS_GPIO4_PD_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO4_PD_LEN)-1)<<PDS_CR_PDS_GPIO4_PD_POS))
#define PDS_CR_PDS_GPIO5_PD                                     PDS_CR_PDS_GPIO5_PD
#define PDS_CR_PDS_GPIO5_PD_POS                                 (5U)
#define PDS_CR_PDS_GPIO5_PD_LEN                                 (1U)
#define PDS_CR_PDS_GPIO5_PD_MSK                                 (((1U<<PDS_CR_PDS_GPIO5_PD_LEN)-1)<<PDS_CR_PDS_GPIO5_PD_POS)
#define PDS_CR_PDS_GPIO5_PD_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO5_PD_LEN)-1)<<PDS_CR_PDS_GPIO5_PD_POS))
#define PDS_CR_PDS_GPIO6_PD                                     PDS_CR_PDS_GPIO6_PD
#define PDS_CR_PDS_GPIO6_PD_POS                                 (6U)
#define PDS_CR_PDS_GPIO6_PD_LEN                                 (1U)
#define PDS_CR_PDS_GPIO6_PD_MSK                                 (((1U<<PDS_CR_PDS_GPIO6_PD_LEN)-1)<<PDS_CR_PDS_GPIO6_PD_POS)
#define PDS_CR_PDS_GPIO6_PD_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO6_PD_LEN)-1)<<PDS_CR_PDS_GPIO6_PD_POS))
#define PDS_CR_PDS_GPIO7_PD                                     PDS_CR_PDS_GPIO7_PD
#define PDS_CR_PDS_GPIO7_PD_POS                                 (7U)
#define PDS_CR_PDS_GPIO7_PD_LEN                                 (1U)
#define PDS_CR_PDS_GPIO7_PD_MSK                                 (((1U<<PDS_CR_PDS_GPIO7_PD_LEN)-1)<<PDS_CR_PDS_GPIO7_PD_POS)
#define PDS_CR_PDS_GPIO7_PD_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO7_PD_LEN)-1)<<PDS_CR_PDS_GPIO7_PD_POS))
#define PDS_CR_PDS_GPIO8_PD                                     PDS_CR_PDS_GPIO8_PD
#define PDS_CR_PDS_GPIO8_PD_POS                                 (8U)
#define PDS_CR_PDS_GPIO8_PD_LEN                                 (1U)
#define PDS_CR_PDS_GPIO8_PD_MSK                                 (((1U<<PDS_CR_PDS_GPIO8_PD_LEN)-1)<<PDS_CR_PDS_GPIO8_PD_POS)
#define PDS_CR_PDS_GPIO8_PD_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO8_PD_LEN)-1)<<PDS_CR_PDS_GPIO8_PD_POS))
#define PDS_CR_PDS_GPIO9_PD                                     PDS_CR_PDS_GPIO9_PD
#define PDS_CR_PDS_GPIO9_PD_POS                                 (9U)
#define PDS_CR_PDS_GPIO9_PD_LEN                                 (1U)
#define PDS_CR_PDS_GPIO9_PD_MSK                                 (((1U<<PDS_CR_PDS_GPIO9_PD_LEN)-1)<<PDS_CR_PDS_GPIO9_PD_POS)
#define PDS_CR_PDS_GPIO9_PD_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO9_PD_LEN)-1)<<PDS_CR_PDS_GPIO9_PD_POS))
#define PDS_CR_PDS_GPIO10_PD                                    PDS_CR_PDS_GPIO10_PD
#define PDS_CR_PDS_GPIO10_PD_POS                                (10U)
#define PDS_CR_PDS_GPIO10_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO10_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO10_PD_LEN)-1)<<PDS_CR_PDS_GPIO10_PD_POS)
#define PDS_CR_PDS_GPIO10_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO10_PD_LEN)-1)<<PDS_CR_PDS_GPIO10_PD_POS))
#define PDS_CR_PDS_GPIO11_PD                                    PDS_CR_PDS_GPIO11_PD
#define PDS_CR_PDS_GPIO11_PD_POS                                (11U)
#define PDS_CR_PDS_GPIO11_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO11_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO11_PD_LEN)-1)<<PDS_CR_PDS_GPIO11_PD_POS)
#define PDS_CR_PDS_GPIO11_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO11_PD_LEN)-1)<<PDS_CR_PDS_GPIO11_PD_POS))
#define PDS_CR_PDS_GPIO12_PD                                    PDS_CR_PDS_GPIO12_PD
#define PDS_CR_PDS_GPIO12_PD_POS                                (12U)
#define PDS_CR_PDS_GPIO12_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO12_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO12_PD_LEN)-1)<<PDS_CR_PDS_GPIO12_PD_POS)
#define PDS_CR_PDS_GPIO12_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO12_PD_LEN)-1)<<PDS_CR_PDS_GPIO12_PD_POS))
#define PDS_CR_PDS_GPIO13_PD                                    PDS_CR_PDS_GPIO13_PD
#define PDS_CR_PDS_GPIO13_PD_POS                                (13U)
#define PDS_CR_PDS_GPIO13_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO13_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO13_PD_LEN)-1)<<PDS_CR_PDS_GPIO13_PD_POS)
#define PDS_CR_PDS_GPIO13_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO13_PD_LEN)-1)<<PDS_CR_PDS_GPIO13_PD_POS))
#define PDS_CR_PDS_GPIO14_PD                                    PDS_CR_PDS_GPIO14_PD
#define PDS_CR_PDS_GPIO14_PD_POS                                (14U)
#define PDS_CR_PDS_GPIO14_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO14_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO14_PD_LEN)-1)<<PDS_CR_PDS_GPIO14_PD_POS)
#define PDS_CR_PDS_GPIO14_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO14_PD_LEN)-1)<<PDS_CR_PDS_GPIO14_PD_POS))
#define PDS_CR_PDS_GPIO15_PD                                    PDS_CR_PDS_GPIO15_PD
#define PDS_CR_PDS_GPIO15_PD_POS                                (15U)
#define PDS_CR_PDS_GPIO15_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO15_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO15_PD_LEN)-1)<<PDS_CR_PDS_GPIO15_PD_POS)
#define PDS_CR_PDS_GPIO15_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO15_PD_LEN)-1)<<PDS_CR_PDS_GPIO15_PD_POS))
#define PDS_CR_PDS_GPIO16_PD                                    PDS_CR_PDS_GPIO16_PD
#define PDS_CR_PDS_GPIO16_PD_POS                                (16U)
#define PDS_CR_PDS_GPIO16_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO16_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO16_PD_LEN)-1)<<PDS_CR_PDS_GPIO16_PD_POS)
#define PDS_CR_PDS_GPIO16_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO16_PD_LEN)-1)<<PDS_CR_PDS_GPIO16_PD_POS))
#define PDS_CR_PDS_GPIO17_PD                                    PDS_CR_PDS_GPIO17_PD
#define PDS_CR_PDS_GPIO17_PD_POS                                (17U)
#define PDS_CR_PDS_GPIO17_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO17_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO17_PD_LEN)-1)<<PDS_CR_PDS_GPIO17_PD_POS)
#define PDS_CR_PDS_GPIO17_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO17_PD_LEN)-1)<<PDS_CR_PDS_GPIO17_PD_POS))
#define PDS_CR_PDS_GPIO18_PD                                    PDS_CR_PDS_GPIO18_PD
#define PDS_CR_PDS_GPIO18_PD_POS                                (18U)
#define PDS_CR_PDS_GPIO18_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO18_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO18_PD_LEN)-1)<<PDS_CR_PDS_GPIO18_PD_POS)
#define PDS_CR_PDS_GPIO18_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO18_PD_LEN)-1)<<PDS_CR_PDS_GPIO18_PD_POS))
#define PDS_CR_PDS_GPIO19_PD                                    PDS_CR_PDS_GPIO19_PD
#define PDS_CR_PDS_GPIO19_PD_POS                                (19U)
#define PDS_CR_PDS_GPIO19_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO19_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO19_PD_LEN)-1)<<PDS_CR_PDS_GPIO19_PD_POS)
#define PDS_CR_PDS_GPIO19_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO19_PD_LEN)-1)<<PDS_CR_PDS_GPIO19_PD_POS))
#define PDS_CR_PDS_GPIO20_PD                                    PDS_CR_PDS_GPIO20_PD
#define PDS_CR_PDS_GPIO20_PD_POS                                (20U)
#define PDS_CR_PDS_GPIO20_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO20_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO20_PD_LEN)-1)<<PDS_CR_PDS_GPIO20_PD_POS)
#define PDS_CR_PDS_GPIO20_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO20_PD_LEN)-1)<<PDS_CR_PDS_GPIO20_PD_POS))
#define PDS_CR_PDS_GPIO21_PD                                    PDS_CR_PDS_GPIO21_PD
#define PDS_CR_PDS_GPIO21_PD_POS                                (21U)
#define PDS_CR_PDS_GPIO21_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO21_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO21_PD_LEN)-1)<<PDS_CR_PDS_GPIO21_PD_POS)
#define PDS_CR_PDS_GPIO21_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO21_PD_LEN)-1)<<PDS_CR_PDS_GPIO21_PD_POS))
#define PDS_CR_PDS_GPIO22_PD                                    PDS_CR_PDS_GPIO22_PD
#define PDS_CR_PDS_GPIO22_PD_POS                                (22U)
#define PDS_CR_PDS_GPIO22_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO22_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO22_PD_LEN)-1)<<PDS_CR_PDS_GPIO22_PD_POS)
#define PDS_CR_PDS_GPIO22_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO22_PD_LEN)-1)<<PDS_CR_PDS_GPIO22_PD_POS))
#define PDS_CR_PDS_GPIO23_PD                                    PDS_CR_PDS_GPIO23_PD
#define PDS_CR_PDS_GPIO23_PD_POS                                (23U)
#define PDS_CR_PDS_GPIO23_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO23_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO23_PD_LEN)-1)<<PDS_CR_PDS_GPIO23_PD_POS)
#define PDS_CR_PDS_GPIO23_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO23_PD_LEN)-1)<<PDS_CR_PDS_GPIO23_PD_POS))
#define PDS_CR_PDS_GPIO24_PD                                    PDS_CR_PDS_GPIO24_PD
#define PDS_CR_PDS_GPIO24_PD_POS                                (24U)
#define PDS_CR_PDS_GPIO24_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO24_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO24_PD_LEN)-1)<<PDS_CR_PDS_GPIO24_PD_POS)
#define PDS_CR_PDS_GPIO24_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO24_PD_LEN)-1)<<PDS_CR_PDS_GPIO24_PD_POS))
#define PDS_CR_PDS_GPIO25_PD                                    PDS_CR_PDS_GPIO25_PD
#define PDS_CR_PDS_GPIO25_PD_POS                                (25U)
#define PDS_CR_PDS_GPIO25_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO25_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO25_PD_LEN)-1)<<PDS_CR_PDS_GPIO25_PD_POS)
#define PDS_CR_PDS_GPIO25_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO25_PD_LEN)-1)<<PDS_CR_PDS_GPIO25_PD_POS))
#define PDS_CR_PDS_GPIO26_PD                                    PDS_CR_PDS_GPIO26_PD
#define PDS_CR_PDS_GPIO26_PD_POS                                (26U)
#define PDS_CR_PDS_GPIO26_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO26_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO26_PD_LEN)-1)<<PDS_CR_PDS_GPIO26_PD_POS)
#define PDS_CR_PDS_GPIO26_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO26_PD_LEN)-1)<<PDS_CR_PDS_GPIO26_PD_POS))
#define PDS_CR_PDS_GPIO27_PD                                    PDS_CR_PDS_GPIO27_PD
#define PDS_CR_PDS_GPIO27_PD_POS                                (27U)
#define PDS_CR_PDS_GPIO27_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO27_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO27_PD_LEN)-1)<<PDS_CR_PDS_GPIO27_PD_POS)
#define PDS_CR_PDS_GPIO27_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO27_PD_LEN)-1)<<PDS_CR_PDS_GPIO27_PD_POS))
#define PDS_CR_PDS_GPIO28_PD                                    PDS_CR_PDS_GPIO28_PD
#define PDS_CR_PDS_GPIO28_PD_POS                                (28U)
#define PDS_CR_PDS_GPIO28_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO28_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO28_PD_LEN)-1)<<PDS_CR_PDS_GPIO28_PD_POS)
#define PDS_CR_PDS_GPIO28_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO28_PD_LEN)-1)<<PDS_CR_PDS_GPIO28_PD_POS))
#define PDS_CR_PDS_GPIO29_PD                                    PDS_CR_PDS_GPIO29_PD
#define PDS_CR_PDS_GPIO29_PD_POS                                (29U)
#define PDS_CR_PDS_GPIO29_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO29_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO29_PD_LEN)-1)<<PDS_CR_PDS_GPIO29_PD_POS)
#define PDS_CR_PDS_GPIO29_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO29_PD_LEN)-1)<<PDS_CR_PDS_GPIO29_PD_POS))
#define PDS_CR_PDS_GPIO30_PD                                    PDS_CR_PDS_GPIO30_PD
#define PDS_CR_PDS_GPIO30_PD_POS                                (30U)
#define PDS_CR_PDS_GPIO30_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO30_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO30_PD_LEN)-1)<<PDS_CR_PDS_GPIO30_PD_POS)
#define PDS_CR_PDS_GPIO30_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO30_PD_LEN)-1)<<PDS_CR_PDS_GPIO30_PD_POS))
#define PDS_CR_PDS_GPIO31_PD                                    PDS_CR_PDS_GPIO31_PD
#define PDS_CR_PDS_GPIO31_PD_POS                                (31U)
#define PDS_CR_PDS_GPIO31_PD_LEN                                (1U)
#define PDS_CR_PDS_GPIO31_PD_MSK                                (((1U<<PDS_CR_PDS_GPIO31_PD_LEN)-1)<<PDS_CR_PDS_GPIO31_PD_POS)
#define PDS_CR_PDS_GPIO31_PD_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO31_PD_LEN)-1)<<PDS_CR_PDS_GPIO31_PD_POS))

