bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/pds_reg.h
/* 0x34 : pds_gpio_pu_set */
#define PDS_GPIO_PU_SET_OFFSET                                  (0x34)
#define PDS_CR_PDS_GPIO0_PU                                     PDS_CR_PDS_GPIO0_PU
#define PDS_CR_PDS_GPIO0_PU_POS                                 (0U)
#define PDS_CR_PDS_GPIO0_PU_LEN                                 (1U)
#define PDS_CR_PDS_GPIO0_PU_MSK                                 (((1U<<PDS_CR_PDS_GPIO0_PU_LEN)-1)<<PDS_CR_PDS_GPIO0_PU_POS)
#define PDS_CR_PDS_GPIO0_PU_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO0_PU_LEN)-1)<<PDS_CR_PDS_GPIO0_PU_POS))
#define PDS_CR_PDS_GPIO1_PU                                     PDS_CR_PDS_GPIO1_PU
#define PDS_CR_PDS_GPIO1_PU_POS                                 (1U)
#define PDS_CR_PDS_GPIO1_PU_LEN                                 (1U)
#define PDS_CR_PDS_GPIO1_PU_MSK                                 (((1U<<PDS_CR_PDS_GPIO1_PU_LEN)-1)<<PDS_CR_PDS_GPIO1_PU_POS)
#define PDS_CR_PDS_GPIO1_PU_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO1_PU_LEN)-1)<<PDS_CR_PDS_GPIO1_PU_POS))
#define PDS_CR_PDS_GPIO2_PU                                     PDS_CR_PDS_GPIO2_PU
#define PDS_CR_PDS_GPIO2_PU_POS                                 (2U)
#define PDS_CR_PDS_GPIO2_PU_LEN                                 (1U)
#define PDS_CR_PDS_GPIO2_PU_MSK                                 (((1U<<PDS_CR_PDS_GPIO2_PU_LEN)-1)<<PDS_CR_PDS_GPIO2_PU_POS)
#define PDS_CR_PDS_GPIO2_PU_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO2_PU_LEN)-1)<<PDS_CR_PDS_GPIO2_PU_POS))
#define PDS_CR_PDS_GPIO3_PU                                     PDS_CR_PDS_GPIO3_PU
#define PDS_CR_PDS_GPIO3_PU_POS                                 (3U)
#define PDS_CR_PDS_GPIO3_PU_LEN                                 (1U)
#define PDS_CR_PDS_GPIO3_PU_MSK                                 (((1U<<PDS_CR_PDS_GPIO3_PU_LEN)-1)<<PDS_CR_PDS_GPIO3_PU_POS)
#define PDS_CR_PDS_GPIO3_PU_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO3_PU_LEN)-1)<<PDS_CR_PDS_GPIO3_PU_POS))
#define PDS_CR_PDS_GPIO4_PU                                     PDS_CR_PDS_GPIO4_PU
#define PDS_CR_PDS_GPIO4_PU_POS                                 (4U)
#define PDS_CR_PDS_GPIO4_PU_LEN                                 (1U)
#define PDS_CR_PDS_GPIO4_PU_MSK                                 (((1U<<PDS_CR_PDS_GPIO4_PU_LEN)-1)<<PDS_CR_PDS_GPIO4_PU_POS)
#define PDS_CR_PDS_GPIO4_PU_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO4_PU_LEN)-1)<<PDS_CR_PDS_GPIO4_PU_POS))
#define PDS_CR_PDS_GPIO5_PU                                     PDS_CR_PDS_GPIO5_PU
#define PDS_CR_PDS_GPIO5_PU_POS                                 (5U)
#define PDS_CR_PDS_GPIO5_PU_LEN                                 (1U)
#define PDS_CR_PDS_GPIO5_PU_MSK                                 (((1U<<PDS_CR_PDS_GPIO5_PU_LEN)-1)<<PDS_CR_PDS_GPIO5_PU_POS)
#define PDS_CR_PDS_GPIO5_PU_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO5_PU_LEN)-1)<<PDS_CR_PDS_GPIO5_PU_POS))
#define PDS_CR_PDS_GPIO6_PU                                     PDS_CR_PDS_GPIO6_PU
#define PDS_CR_PDS_GPIO6_PU_POS                                 (6U)
#define PDS_CR_PDS_GPIO6_PU_LEN                                 (1U)
#define PDS_CR_PDS_GPIO6_PU_MSK                                 (((1U<<PDS_CR_PDS_GPIO6_PU_LEN)-1)<<PDS_CR_PDS_GPIO6_PU_POS)
#define PDS_CR_PDS_GPIO6_PU_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO6_PU_LEN)-1)<<PDS_CR_PDS_GPIO6_PU_POS))
#define PDS_CR_PDS_GPIO7_PU                                     PDS_CR_PDS_GPIO7_PU
#define PDS_CR_PDS_GPIO7_PU_POS                                 (7U)
#define PDS_CR_PDS_GPIO7_PU_LEN                                 (1U)
#define PDS_CR_PDS_GPIO7_PU_MSK                                 (((1U<<PDS_CR_PDS_GPIO7_PU_LEN)-1)<<PDS_CR_PDS_GPIO7_PU_POS)
#define PDS_CR_PDS_GPIO7_PU_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO7_PU_LEN)-1)<<PDS_CR_PDS_GPIO7_PU_POS))
#define PDS_CR_PDS_GPIO8_PU                                     PDS_CR_PDS_GPIO8_PU
#define PDS_CR_PDS_GPIO8_PU_POS                                 (8U)
#define PDS_CR_PDS_GPIO8_PU_LEN                                 (1U)
#define PDS_CR_PDS_GPIO8_PU_MSK                                 (((1U<<PDS_CR_PDS_GPIO8_PU_LEN)-1)<<PDS_CR_PDS_GPIO8_PU_POS)
#define PDS_CR_PDS_GPIO8_PU_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO8_PU_LEN)-1)<<PDS_CR_PDS_GPIO8_PU_POS))
#define PDS_CR_PDS_GPIO9_PU                                     PDS_CR_PDS_GPIO9_PU
#define PDS_CR_PDS_GPIO9_PU_POS                                 (9U)
#define PDS_CR_PDS_GPIO9_PU_LEN                                 (1U)
#define PDS_CR_PDS_GPIO9_PU_MSK                                 (((1U<<PDS_CR_PDS_GPIO9_PU_LEN)-1)<<PDS_CR_PDS_GPIO9_PU_POS)
#define PDS_CR_PDS_GPIO9_PU_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO9_PU_LEN)-1)<<PDS_CR_PDS_GPIO9_PU_POS))
#define PDS_CR_PDS_GPIO10_PU                                    PDS_CR_PDS_GPIO10_PU
#define PDS_CR_PDS_GPIO10_PU_POS                                (10U)
#define PDS_CR_PDS_GPIO10_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO10_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO10_PU_LEN)-1)<<PDS_CR_PDS_GPIO10_PU_POS)
#define PDS_CR_PDS_GPIO10_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO10_PU_LEN)-1)<<PDS_CR_PDS_GPIO10_PU_POS))
#define PDS_CR_PDS_GPIO11_PU                                    PDS_CR_PDS_GPIO11_PU
#define PDS_CR_PDS_GPIO11_PU_POS                                (11U)
#define PDS_CR_PDS_GPIO11_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO11_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO11_PU_LEN)-1)<<PDS_CR_PDS_GPIO11_PU_POS)
#define PDS_CR_PDS_GPIO11_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO11_PU_LEN)-1)<<PDS_CR_PDS_GPIO11_PU_POS))
#define PDS_CR_PDS_GPIO12_PU                                    PDS_CR_PDS_GPIO12_PU
#define PDS_CR_PDS_GPIO12_PU_POS                                (12U)
#define PDS_CR_PDS_GPIO12_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO12_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO12_PU_LEN)-1)<<PDS_CR_PDS_GPIO12_PU_POS)
#define PDS_CR_PDS_GPIO12_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO12_PU_LEN)-1)<<PDS_CR_PDS_GPIO12_PU_POS))
#define PDS_CR_PDS_GPIO13_PU                                    PDS_CR_PDS_GPIO13_PU
#define PDS_CR_PDS_GPIO13_PU_POS                                (13U)
#define PDS_CR_PDS_GPIO13_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO13_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO13_PU_LEN)-1)<<PDS_CR_PDS_GPIO13_PU_POS)
#define PDS_CR_PDS_GPIO13_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO13_PU_LEN)-1)<<PDS_CR_PDS_GPIO13_PU_POS))
#define PDS_CR_PDS_GPIO14_PU                                    PDS_CR_PDS_GPIO14_PU
#define PDS_CR_PDS_GPIO14_PU_POS                                (14U)
#define PDS_CR_PDS_GPIO14_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO14_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO14_PU_LEN)-1)<<PDS_CR_PDS_GPIO14_PU_POS)
#define PDS_CR_PDS_GPIO14_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO14_PU_LEN)-1)<<PDS_CR_PDS_GPIO14_PU_POS))
#define PDS_CR_PDS_GPIO15_PU                                    PDS_CR_PDS_GPIO15_PU
#define PDS_CR_PDS_GPIO15_PU_POS                                (15U)
#define PDS_CR_PDS_GPIO15_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO15_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO15_PU_LEN)-1)<<PDS_CR_PDS_GPIO15_PU_POS)
#define PDS_CR_PDS_GPIO15_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO15_PU_LEN)-1)<<PDS_CR_PDS_GPIO15_PU_POS))
#define PDS_CR_PDS_GPIO16_PU                                    PDS_CR_PDS_GPIO16_PU
#define PDS_CR_PDS_GPIO16_PU_POS                                (16U)
#define PDS_CR_PDS_GPIO16_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO16_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO16_PU_LEN)-1)<<PDS_CR_PDS_GPIO16_PU_POS)
#define PDS_CR_PDS_GPIO16_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO16_PU_LEN)-1)<<PDS_CR_PDS_GPIO16_PU_POS))
#define PDS_CR_PDS_GPIO17_PU                                    PDS_CR_PDS_GPIO17_PU
#define PDS_CR_PDS_GPIO17_PU_POS                                (17U)
#define PDS_CR_PDS_GPIO17_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO17_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO17_PU_LEN)-1)<<PDS_CR_PDS_GPIO17_PU_POS)
#define PDS_CR_PDS_GPIO17_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO17_PU_LEN)-1)<<PDS_CR_PDS_GPIO17_PU_POS))
#define PDS_CR_PDS_GPIO18_PU                                    PDS_CR_PDS_GPIO18_PU
#define PDS_CR_PDS_GPIO18_PU_POS                                (18U)
#define PDS_CR_PDS_GPIO18_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO18_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO18_PU_LEN)-1)<<PDS_CR_PDS_GPIO18_PU_POS)
#define PDS_CR_PDS_GPIO18_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO18_PU_LEN)-1)<<PDS_CR_PDS_GPIO18_PU_POS))
#define PDS_CR_PDS_GPIO19_PU                                    PDS_CR_PDS_GPIO19_PU
#define PDS_CR_PDS_GPIO19_PU_POS                                (19U)
#define PDS_CR_PDS_GPIO19_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO19_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO19_PU_LEN)-1)<<PDS_CR_PDS_GPIO19_PU_POS)
#define PDS_CR_PDS_GPIO19_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO19_PU_LEN)-1)<<PDS_CR_PDS_GPIO19_PU_POS))
#define PDS_CR_PDS_GPIO20_PU                                    PDS_CR_PDS_GPIO20_PU
#define PDS_CR_PDS_GPIO20_PU_POS                                (20U)
#define PDS_CR_PDS_GPIO20_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO20_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO20_PU_LEN)-1)<<PDS_CR_PDS_GPIO20_PU_POS)
#define PDS_CR_PDS_GPIO20_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO20_PU_LEN)-1)<<PDS_CR_PDS_GPIO20_PU_POS))
#define PDS_CR_PDS_GPIO21_PU                                    PDS_CR_PDS_GPIO21_PU
#define PDS_CR_PDS_GPIO21_PU_POS                                (21U)
#define PDS_CR_PDS_GPIO21_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO21_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO21_PU_LEN)-1)<<PDS_CR_PDS_GPIO21_PU_POS)
#define PDS_CR_PDS_GPIO21_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO21_PU_LEN)-1)<<PDS_CR_PDS_GPIO21_PU_POS))
#define PDS_CR_PDS_GPIO22_PU                                    PDS_CR_PDS_GPIO22_PU
#define PDS_CR_PDS_GPIO22_PU_POS                                (22U)
#define PDS_CR_PDS_GPIO22_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO22_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO22_PU_LEN)-1)<<PDS_CR_PDS_GPIO22_PU_POS)
#define PDS_CR_PDS_GPIO22_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO22_PU_LEN)-1)<<PDS_CR_PDS_GPIO22_PU_POS))
#define PDS_CR_PDS_GPIO23_PU                                    PDS_CR_PDS_GPIO23_PU
#define PDS_CR_PDS_GPIO23_PU_POS                                (23U)
#define PDS_CR_PDS_GPIO23_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO23_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO23_PU_LEN)-1)<<PDS_CR_PDS_GPIO23_PU_POS)
#define PDS_CR_PDS_GPIO23_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO23_PU_LEN)-1)<<PDS_CR_PDS_GPIO23_PU_POS))
#define PDS_CR_PDS_GPIO24_PU                                    PDS_CR_PDS_GPIO24_PU
#define PDS_CR_PDS_GPIO24_PU_POS                                (24U)
#define PDS_CR_PDS_GPIO24_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO24_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO24_PU_LEN)-1)<<PDS_CR_PDS_GPIO24_PU_POS)
#define PDS_CR_PDS_GPIO24_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO24_PU_LEN)-1)<<PDS_CR_PDS_GPIO24_PU_POS))
#define PDS_CR_PDS_GPIO25_PU                                    PDS_CR_PDS_GPIO25_PU
#define PDS_CR_PDS_GPIO25_PU_POS                                (25U)
#define PDS_CR_PDS_GPIO25_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO25_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO25_PU_LEN)-1)<<PDS_CR_PDS_GPIO25_PU_POS)
#define PDS_CR_PDS_GPIO25_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO25_PU_LEN)-1)<<PDS_CR_PDS_GPIO25_PU_POS))
#define PDS_CR_PDS_GPIO26_PU                                    PDS_CR_PDS_GPIO26_PU
#define PDS_CR_PDS_GPIO26_PU_POS                                (26U)
#define PDS_CR_PDS_GPIO26_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO26_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO26_PU_LEN)-1)<<PDS_CR_PDS_GPIO26_PU_POS)
#define PDS_CR_PDS_GPIO26_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO26_PU_LEN)-1)<<PDS_CR_PDS_GPIO26_PU_POS))
#define PDS_CR_PDS_GPIO27_PU                                    PDS_CR_PDS_GPIO27_PU
#define PDS_CR_PDS_GPIO27_PU_POS                                (27U)
#define PDS_CR_PDS_GPIO27_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO27_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO27_PU_LEN)-1)<<PDS_CR_PDS_GPIO27_PU_POS)
#define PDS_CR_PDS_GPIO27_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO27_PU_LEN)-1)<<PDS_CR_PDS_GPIO27_PU_POS))
#define PDS_CR_PDS_GPIO28_PU                                    PDS_CR_PDS_GPIO28_PU
#define PDS_CR_PDS_GPIO28_PU_POS                                (28U)
#define PDS_CR_PDS_GPIO28_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO28_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO28_PU_LEN)-1)<<PDS_CR_PDS_GPIO28_PU_POS)
#define PDS_CR_PDS_GPIO28_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO28_PU_LEN)-1)<<PDS_CR_PDS_GPIO28_PU_POS))
#define PDS_CR_PDS_GPIO29_PU                                    PDS_CR_PDS_GPIO29_PU
#define PDS_CR_PDS_GPIO29_PU_POS                                (29U)
#define PDS_CR_PDS_GPIO29_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO29_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO29_PU_LEN)-1)<<PDS_CR_PDS_GPIO29_PU_POS)
#define PDS_CR_PDS_GPIO29_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO29_PU_LEN)-1)<<PDS_CR_PDS_GPIO29_PU_POS))
#define PDS_CR_PDS_GPIO30_PU                                    PDS_CR_PDS_GPIO30_PU
#define PDS_CR_PDS_GPIO30_PU_POS                                (30U)
#define PDS_CR_PDS_GPIO30_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO30_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO30_PU_LEN)-1)<<PDS_CR_PDS_GPIO30_PU_POS)
#define PDS_CR_PDS_GPIO30_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO30_PU_LEN)-1)<<PDS_CR_PDS_GPIO30_PU_POS))
#define PDS_CR_PDS_GPIO31_PU                                    PDS_CR_PDS_GPIO31_PU
#define PDS_CR_PDS_GPIO31_PU_POS                                (31U)
#define PDS_CR_PDS_GPIO31_PU_LEN                                (1U)
#define PDS_CR_PDS_GPIO31_PU_MSK                                (((1U<<PDS_CR_PDS_GPIO31_PU_LEN)-1)<<PDS_CR_PDS_GPIO31_PU_POS)
#define PDS_CR_PDS_GPIO31_PU_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO31_PU_LEN)-1)<<PDS_CR_PDS_GPIO31_PU_POS))

