bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/pds_reg.h
/* 0x38 : pds_gpio_ie_set */
#define PDS_GPIO_IE_SET_OFFSET                                  (0x38)
#define PDS_CR_PDS_GPIO0_IE                                     PDS_CR_PDS_GPIO0_IE
#define PDS_CR_PDS_GPIO0_IE_POS                                 (0U)
#define PDS_CR_PDS_GPIO0_IE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO0_IE_MSK                                 (((1U<<PDS_CR_PDS_GPIO0_IE_LEN)-1)<<PDS_CR_PDS_GPIO0_IE_POS)
#define PDS_CR_PDS_GPIO0_IE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO0_IE_LEN)-1)<<PDS_CR_PDS_GPIO0_IE_POS))
#define PDS_CR_PDS_GPIO1_IE                                     PDS_CR_PDS_GPIO1_IE
#define PDS_CR_PDS_GPIO1_IE_POS                                 (1U)
#define PDS_CR_PDS_GPIO1_IE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO1_IE_MSK                                 (((1U<<PDS_CR_PDS_GPIO1_IE_LEN)-1)<<PDS_CR_PDS_GPIO1_IE_POS)
#define PDS_CR_PDS_GPIO1_IE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO1_IE_LEN)-1)<<PDS_CR_PDS_GPIO1_IE_POS))
#define PDS_CR_PDS_GPIO2_IE                                     PDS_CR_PDS_GPIO2_IE
#define PDS_CR_PDS_GPIO2_IE_POS                                 (2U)
#define PDS_CR_PDS_GPIO2_IE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO2_IE_MSK                                 (((1U<<PDS_CR_PDS_GPIO2_IE_LEN)-1)<<PDS_CR_PDS_GPIO2_IE_POS)
#define PDS_CR_PDS_GPIO2_IE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO2_IE_LEN)-1)<<PDS_CR_PDS_GPIO2_IE_POS))
#define PDS_CR_PDS_GPIO3_IE                                     PDS_CR_PDS_GPIO3_IE
#define PDS_CR_PDS_GPIO3_IE_POS                                 (3U)
#define PDS_CR_PDS_GPIO3_IE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO3_IE_MSK                                 (((1U<<PDS_CR_PDS_GPIO3_IE_LEN)-1)<<PDS_CR_PDS_GPIO3_IE_POS)
#define PDS_CR_PDS_GPIO3_IE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO3_IE_LEN)-1)<<PDS_CR_PDS_GPIO3_IE_POS))
#define PDS_CR_PDS_GPIO4_IE                                     PDS_CR_PDS_GPIO4_IE
#define PDS_CR_PDS_GPIO4_IE_POS                                 (4U)
#define PDS_CR_PDS_GPIO4_IE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO4_IE_MSK                                 (((1U<<PDS_CR_PDS_GPIO4_IE_LEN)-1)<<PDS_CR_PDS_GPIO4_IE_POS)
#define PDS_CR_PDS_GPIO4_IE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO4_IE_LEN)-1)<<PDS_CR_PDS_GPIO4_IE_POS))
#define PDS_CR_PDS_GPIO5_IE                                     PDS_CR_PDS_GPIO5_IE
#define PDS_CR_PDS_GPIO5_IE_POS                                 (5U)
#define PDS_CR_PDS_GPIO5_IE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO5_IE_MSK                                 (((1U<<PDS_CR_PDS_GPIO5_IE_LEN)-1)<<PDS_CR_PDS_GPIO5_IE_POS)
#define PDS_CR_PDS_GPIO5_IE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO5_IE_LEN)-1)<<PDS_CR_PDS_GPIO5_IE_POS))
#define PDS_CR_PDS_GPIO6_IE                                     PDS_CR_PDS_GPIO6_IE
#define PDS_CR_PDS_GPIO6_IE_POS                                 (6U)
#define PDS_CR_PDS_GPIO6_IE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO6_IE_MSK                                 (((1U<<PDS_CR_PDS_GPIO6_IE_LEN)-1)<<PDS_CR_PDS_GPIO6_IE_POS)
#define PDS_CR_PDS_GPIO6_IE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO6_IE_LEN)-1)<<PDS_CR_PDS_GPIO6_IE_POS))
#define PDS_CR_PDS_GPIO7_IE                                     PDS_CR_PDS_GPIO7_IE
#define PDS_CR_PDS_GPIO7_IE_POS                                 (7U)
#define PDS_CR_PDS_GPIO7_IE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO7_IE_MSK                                 (((1U<<PDS_CR_PDS_GPIO7_IE_LEN)-1)<<PDS_CR_PDS_GPIO7_IE_POS)
#define PDS_CR_PDS_GPIO7_IE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO7_IE_LEN)-1)<<PDS_CR_PDS_GPIO7_IE_POS))
#define PDS_CR_PDS_GPIO8_IE                                     PDS_CR_PDS_GPIO8_IE
#define PDS_CR_PDS_GPIO8_IE_POS                                 (8U)
#define PDS_CR_PDS_GPIO8_IE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO8_IE_MSK                                 (((1U<<PDS_CR_PDS_GPIO8_IE_LEN)-1)<<PDS_CR_PDS_GPIO8_IE_POS)
#define PDS_CR_PDS_GPIO8_IE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO8_IE_LEN)-1)<<PDS_CR_PDS_GPIO8_IE_POS))
#define PDS_CR_PDS_GPIO9_IE                                     PDS_CR_PDS_GPIO9_IE
#define PDS_CR_PDS_GPIO9_IE_POS                                 (9U)
#define PDS_CR_PDS_GPIO9_IE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO9_IE_MSK                                 (((1U<<PDS_CR_PDS_GPIO9_IE_LEN)-1)<<PDS_CR_PDS_GPIO9_IE_POS)
#define PDS_CR_PDS_GPIO9_IE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO9_IE_LEN)-1)<<PDS_CR_PDS_GPIO9_IE_POS))
#define PDS_CR_PDS_GPIO10_IE                                    PDS_CR_PDS_GPIO10_IE
#define PDS_CR_PDS_GPIO10_IE_POS                                (10U)
#define PDS_CR_PDS_GPIO10_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO10_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO10_IE_LEN)-1)<<PDS_CR_PDS_GPIO10_IE_POS)
#define PDS_CR_PDS_GPIO10_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO10_IE_LEN)-1)<<PDS_CR_PDS_GPIO10_IE_POS))
#define PDS_CR_PDS_GPIO11_IE                                    PDS_CR_PDS_GPIO11_IE
#define PDS_CR_PDS_GPIO11_IE_POS                                (11U)
#define PDS_CR_PDS_GPIO11_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO11_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO11_IE_LEN)-1)<<PDS_CR_PDS_GPIO11_IE_POS)
#define PDS_CR_PDS_GPIO11_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO11_IE_LEN)-1)<<PDS_CR_PDS_GPIO11_IE_POS))
#define PDS_CR_PDS_GPIO12_IE                                    PDS_CR_PDS_GPIO12_IE
#define PDS_CR_PDS_GPIO12_IE_POS                                (12U)
#define PDS_CR_PDS_GPIO12_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO12_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO12_IE_LEN)-1)<<PDS_CR_PDS_GPIO12_IE_POS)
#define PDS_CR_PDS_GPIO12_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO12_IE_LEN)-1)<<PDS_CR_PDS_GPIO12_IE_POS))
#define PDS_CR_PDS_GPIO13_IE                                    PDS_CR_PDS_GPIO13_IE
#define PDS_CR_PDS_GPIO13_IE_POS                                (13U)
#define PDS_CR_PDS_GPIO13_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO13_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO13_IE_LEN)-1)<<PDS_CR_PDS_GPIO13_IE_POS)
#define PDS_CR_PDS_GPIO13_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO13_IE_LEN)-1)<<PDS_CR_PDS_GPIO13_IE_POS))
#define PDS_CR_PDS_GPIO14_IE                                    PDS_CR_PDS_GPIO14_IE
#define PDS_CR_PDS_GPIO14_IE_POS                                (14U)
#define PDS_CR_PDS_GPIO14_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO14_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO14_IE_LEN)-1)<<PDS_CR_PDS_GPIO14_IE_POS)
#define PDS_CR_PDS_GPIO14_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO14_IE_LEN)-1)<<PDS_CR_PDS_GPIO14_IE_POS))
#define PDS_CR_PDS_GPIO15_IE                                    PDS_CR_PDS_GPIO15_IE
#define PDS_CR_PDS_GPIO15_IE_POS                                (15U)
#define PDS_CR_PDS_GPIO15_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO15_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO15_IE_LEN)-1)<<PDS_CR_PDS_GPIO15_IE_POS)
#define PDS_CR_PDS_GPIO15_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO15_IE_LEN)-1)<<PDS_CR_PDS_GPIO15_IE_POS))
#define PDS_CR_PDS_GPIO16_IE                                    PDS_CR_PDS_GPIO16_IE
#define PDS_CR_PDS_GPIO16_IE_POS                                (16U)
#define PDS_CR_PDS_GPIO16_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO16_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO16_IE_LEN)-1)<<PDS_CR_PDS_GPIO16_IE_POS)
#define PDS_CR_PDS_GPIO16_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO16_IE_LEN)-1)<<PDS_CR_PDS_GPIO16_IE_POS))
#define PDS_CR_PDS_GPIO17_IE                                    PDS_CR_PDS_GPIO17_IE
#define PDS_CR_PDS_GPIO17_IE_POS                                (17U)
#define PDS_CR_PDS_GPIO17_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO17_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO17_IE_LEN)-1)<<PDS_CR_PDS_GPIO17_IE_POS)
#define PDS_CR_PDS_GPIO17_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO17_IE_LEN)-1)<<PDS_CR_PDS_GPIO17_IE_POS))
#define PDS_CR_PDS_GPIO18_IE                                    PDS_CR_PDS_GPIO18_IE
#define PDS_CR_PDS_GPIO18_IE_POS                                (18U)
#define PDS_CR_PDS_GPIO18_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO18_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO18_IE_LEN)-1)<<PDS_CR_PDS_GPIO18_IE_POS)
#define PDS_CR_PDS_GPIO18_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO18_IE_LEN)-1)<<PDS_CR_PDS_GPIO18_IE_POS))
#define PDS_CR_PDS_GPIO19_IE                                    PDS_CR_PDS_GPIO19_IE
#define PDS_CR_PDS_GPIO19_IE_POS                                (19U)
#define PDS_CR_PDS_GPIO19_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO19_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO19_IE_LEN)-1)<<PDS_CR_PDS_GPIO19_IE_POS)
#define PDS_CR_PDS_GPIO19_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO19_IE_LEN)-1)<<PDS_CR_PDS_GPIO19_IE_POS))
#define PDS_CR_PDS_GPIO20_IE                                    PDS_CR_PDS_GPIO20_IE
#define PDS_CR_PDS_GPIO20_IE_POS                                (20U)
#define PDS_CR_PDS_GPIO20_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO20_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO20_IE_LEN)-1)<<PDS_CR_PDS_GPIO20_IE_POS)
#define PDS_CR_PDS_GPIO20_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO20_IE_LEN)-1)<<PDS_CR_PDS_GPIO20_IE_POS))
#define PDS_CR_PDS_GPIO21_IE                                    PDS_CR_PDS_GPIO21_IE
#define PDS_CR_PDS_GPIO21_IE_POS                                (21U)
#define PDS_CR_PDS_GPIO21_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO21_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO21_IE_LEN)-1)<<PDS_CR_PDS_GPIO21_IE_POS)
#define PDS_CR_PDS_GPIO21_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO21_IE_LEN)-1)<<PDS_CR_PDS_GPIO21_IE_POS))
#define PDS_CR_PDS_GPIO22_IE                                    PDS_CR_PDS_GPIO22_IE
#define PDS_CR_PDS_GPIO22_IE_POS                                (22U)
#define PDS_CR_PDS_GPIO22_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO22_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO22_IE_LEN)-1)<<PDS_CR_PDS_GPIO22_IE_POS)
#define PDS_CR_PDS_GPIO22_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO22_IE_LEN)-1)<<PDS_CR_PDS_GPIO22_IE_POS))
#define PDS_CR_PDS_GPIO23_IE                                    PDS_CR_PDS_GPIO23_IE
#define PDS_CR_PDS_GPIO23_IE_POS                                (23U)
#define PDS_CR_PDS_GPIO23_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO23_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO23_IE_LEN)-1)<<PDS_CR_PDS_GPIO23_IE_POS)
#define PDS_CR_PDS_GPIO23_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO23_IE_LEN)-1)<<PDS_CR_PDS_GPIO23_IE_POS))
#define PDS_CR_PDS_GPIO24_IE                                    PDS_CR_PDS_GPIO24_IE
#define PDS_CR_PDS_GPIO24_IE_POS                                (24U)
#define PDS_CR_PDS_GPIO24_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO24_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO24_IE_LEN)-1)<<PDS_CR_PDS_GPIO24_IE_POS)
#define PDS_CR_PDS_GPIO24_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO24_IE_LEN)-1)<<PDS_CR_PDS_GPIO24_IE_POS))
#define PDS_CR_PDS_GPIO25_IE                                    PDS_CR_PDS_GPIO25_IE
#define PDS_CR_PDS_GPIO25_IE_POS                                (25U)
#define PDS_CR_PDS_GPIO25_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO25_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO25_IE_LEN)-1)<<PDS_CR_PDS_GPIO25_IE_POS)
#define PDS_CR_PDS_GPIO25_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO25_IE_LEN)-1)<<PDS_CR_PDS_GPIO25_IE_POS))
#define PDS_CR_PDS_GPIO26_IE                                    PDS_CR_PDS_GPIO26_IE
#define PDS_CR_PDS_GPIO26_IE_POS                                (26U)
#define PDS_CR_PDS_GPIO26_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO26_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO26_IE_LEN)-1)<<PDS_CR_PDS_GPIO26_IE_POS)
#define PDS_CR_PDS_GPIO26_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO26_IE_LEN)-1)<<PDS_CR_PDS_GPIO26_IE_POS))
#define PDS_CR_PDS_GPIO27_IE                                    PDS_CR_PDS_GPIO27_IE
#define PDS_CR_PDS_GPIO27_IE_POS                                (27U)
#define PDS_CR_PDS_GPIO27_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO27_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO27_IE_LEN)-1)<<PDS_CR_PDS_GPIO27_IE_POS)
#define PDS_CR_PDS_GPIO27_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO27_IE_LEN)-1)<<PDS_CR_PDS_GPIO27_IE_POS))
#define PDS_CR_PDS_GPIO28_IE                                    PDS_CR_PDS_GPIO28_IE
#define PDS_CR_PDS_GPIO28_IE_POS                                (28U)
#define PDS_CR_PDS_GPIO28_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO28_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO28_IE_LEN)-1)<<PDS_CR_PDS_GPIO28_IE_POS)
#define PDS_CR_PDS_GPIO28_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO28_IE_LEN)-1)<<PDS_CR_PDS_GPIO28_IE_POS))
#define PDS_CR_PDS_GPIO29_IE                                    PDS_CR_PDS_GPIO29_IE
#define PDS_CR_PDS_GPIO29_IE_POS                                (29U)
#define PDS_CR_PDS_GPIO29_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO29_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO29_IE_LEN)-1)<<PDS_CR_PDS_GPIO29_IE_POS)
#define PDS_CR_PDS_GPIO29_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO29_IE_LEN)-1)<<PDS_CR_PDS_GPIO29_IE_POS))
#define PDS_CR_PDS_GPIO30_IE                                    PDS_CR_PDS_GPIO30_IE
#define PDS_CR_PDS_GPIO30_IE_POS                                (30U)
#define PDS_CR_PDS_GPIO30_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO30_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO30_IE_LEN)-1)<<PDS_CR_PDS_GPIO30_IE_POS)
#define PDS_CR_PDS_GPIO30_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO30_IE_LEN)-1)<<PDS_CR_PDS_GPIO30_IE_POS))
#define PDS_CR_PDS_GPIO31_IE                                    PDS_CR_PDS_GPIO31_IE
#define PDS_CR_PDS_GPIO31_IE_POS                                (31U)
#define PDS_CR_PDS_GPIO31_IE_LEN                                (1U)
#define PDS_CR_PDS_GPIO31_IE_MSK                                (((1U<<PDS_CR_PDS_GPIO31_IE_LEN)-1)<<PDS_CR_PDS_GPIO31_IE_POS)
#define PDS_CR_PDS_GPIO31_IE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO31_IE_LEN)-1)<<PDS_CR_PDS_GPIO31_IE_POS))

