bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/pds_reg.h
/* 0x3C : pds_gpio_oe_set */
#define PDS_GPIO_OE_SET_OFFSET                                  (0x3C)
#define PDS_CR_PDS_GPIO0_OE                                     PDS_CR_PDS_GPIO0_OE
#define PDS_CR_PDS_GPIO0_OE_POS                                 (0U)
#define PDS_CR_PDS_GPIO0_OE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO0_OE_MSK                                 (((1U<<PDS_CR_PDS_GPIO0_OE_LEN)-1)<<PDS_CR_PDS_GPIO0_OE_POS)
#define PDS_CR_PDS_GPIO0_OE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO0_OE_LEN)-1)<<PDS_CR_PDS_GPIO0_OE_POS))
#define PDS_CR_PDS_GPIO1_OE                                     PDS_CR_PDS_GPIO1_OE
#define PDS_CR_PDS_GPIO1_OE_POS                                 (1U)
#define PDS_CR_PDS_GPIO1_OE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO1_OE_MSK                                 (((1U<<PDS_CR_PDS_GPIO1_OE_LEN)-1)<<PDS_CR_PDS_GPIO1_OE_POS)
#define PDS_CR_PDS_GPIO1_OE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO1_OE_LEN)-1)<<PDS_CR_PDS_GPIO1_OE_POS))
#define PDS_CR_PDS_GPIO2_OE                                     PDS_CR_PDS_GPIO2_OE
#define PDS_CR_PDS_GPIO2_OE_POS                                 (2U)
#define PDS_CR_PDS_GPIO2_OE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO2_OE_MSK                                 (((1U<<PDS_CR_PDS_GPIO2_OE_LEN)-1)<<PDS_CR_PDS_GPIO2_OE_POS)
#define PDS_CR_PDS_GPIO2_OE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO2_OE_LEN)-1)<<PDS_CR_PDS_GPIO2_OE_POS))
#define PDS_CR_PDS_GPIO3_OE                                     PDS_CR_PDS_GPIO3_OE
#define PDS_CR_PDS_GPIO3_OE_POS                                 (3U)
#define PDS_CR_PDS_GPIO3_OE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO3_OE_MSK                                 (((1U<<PDS_CR_PDS_GPIO3_OE_LEN)-1)<<PDS_CR_PDS_GPIO3_OE_POS)
#define PDS_CR_PDS_GPIO3_OE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO3_OE_LEN)-1)<<PDS_CR_PDS_GPIO3_OE_POS))
#define PDS_CR_PDS_GPIO4_OE                                     PDS_CR_PDS_GPIO4_OE
#define PDS_CR_PDS_GPIO4_OE_POS                                 (4U)
#define PDS_CR_PDS_GPIO4_OE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO4_OE_MSK                                 (((1U<<PDS_CR_PDS_GPIO4_OE_LEN)-1)<<PDS_CR_PDS_GPIO4_OE_POS)
#define PDS_CR_PDS_GPIO4_OE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO4_OE_LEN)-1)<<PDS_CR_PDS_GPIO4_OE_POS))
#define PDS_CR_PDS_GPIO5_OE                                     PDS_CR_PDS_GPIO5_OE
#define PDS_CR_PDS_GPIO5_OE_POS                                 (5U)
#define PDS_CR_PDS_GPIO5_OE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO5_OE_MSK                                 (((1U<<PDS_CR_PDS_GPIO5_OE_LEN)-1)<<PDS_CR_PDS_GPIO5_OE_POS)
#define PDS_CR_PDS_GPIO5_OE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO5_OE_LEN)-1)<<PDS_CR_PDS_GPIO5_OE_POS))
#define PDS_CR_PDS_GPIO6_OE                                     PDS_CR_PDS_GPIO6_OE
#define PDS_CR_PDS_GPIO6_OE_POS                                 (6U)
#define PDS_CR_PDS_GPIO6_OE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO6_OE_MSK                                 (((1U<<PDS_CR_PDS_GPIO6_OE_LEN)-1)<<PDS_CR_PDS_GPIO6_OE_POS)
#define PDS_CR_PDS_GPIO6_OE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO6_OE_LEN)-1)<<PDS_CR_PDS_GPIO6_OE_POS))
#define PDS_CR_PDS_GPIO7_OE                                     PDS_CR_PDS_GPIO7_OE
#define PDS_CR_PDS_GPIO7_OE_POS                                 (7U)
#define PDS_CR_PDS_GPIO7_OE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO7_OE_MSK                                 (((1U<<PDS_CR_PDS_GPIO7_OE_LEN)-1)<<PDS_CR_PDS_GPIO7_OE_POS)
#define PDS_CR_PDS_GPIO7_OE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO7_OE_LEN)-1)<<PDS_CR_PDS_GPIO7_OE_POS))
#define PDS_CR_PDS_GPIO8_OE                                     PDS_CR_PDS_GPIO8_OE
#define PDS_CR_PDS_GPIO8_OE_POS                                 (8U)
#define PDS_CR_PDS_GPIO8_OE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO8_OE_MSK                                 (((1U<<PDS_CR_PDS_GPIO8_OE_LEN)-1)<<PDS_CR_PDS_GPIO8_OE_POS)
#define PDS_CR_PDS_GPIO8_OE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO8_OE_LEN)-1)<<PDS_CR_PDS_GPIO8_OE_POS))
#define PDS_CR_PDS_GPIO9_OE                                     PDS_CR_PDS_GPIO9_OE
#define PDS_CR_PDS_GPIO9_OE_POS                                 (9U)
#define PDS_CR_PDS_GPIO9_OE_LEN                                 (1U)
#define PDS_CR_PDS_GPIO9_OE_MSK                                 (((1U<<PDS_CR_PDS_GPIO9_OE_LEN)-1)<<PDS_CR_PDS_GPIO9_OE_POS)
#define PDS_CR_PDS_GPIO9_OE_UMSK                                (~(((1U<<PDS_CR_PDS_GPIO9_OE_LEN)-1)<<PDS_CR_PDS_GPIO9_OE_POS))
#define PDS_CR_PDS_GPIO10_OE                                    PDS_CR_PDS_GPIO10_OE
#define PDS_CR_PDS_GPIO10_OE_POS                                (10U)
#define PDS_CR_PDS_GPIO10_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO10_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO10_OE_LEN)-1)<<PDS_CR_PDS_GPIO10_OE_POS)
#define PDS_CR_PDS_GPIO10_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO10_OE_LEN)-1)<<PDS_CR_PDS_GPIO10_OE_POS))
#define PDS_CR_PDS_GPIO11_OE                                    PDS_CR_PDS_GPIO11_OE
#define PDS_CR_PDS_GPIO11_OE_POS                                (11U)
#define PDS_CR_PDS_GPIO11_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO11_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO11_OE_LEN)-1)<<PDS_CR_PDS_GPIO11_OE_POS)
#define PDS_CR_PDS_GPIO11_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO11_OE_LEN)-1)<<PDS_CR_PDS_GPIO11_OE_POS))
#define PDS_CR_PDS_GPIO12_OE                                    PDS_CR_PDS_GPIO12_OE
#define PDS_CR_PDS_GPIO12_OE_POS                                (12U)
#define PDS_CR_PDS_GPIO12_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO12_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO12_OE_LEN)-1)<<PDS_CR_PDS_GPIO12_OE_POS)
#define PDS_CR_PDS_GPIO12_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO12_OE_LEN)-1)<<PDS_CR_PDS_GPIO12_OE_POS))
#define PDS_CR_PDS_GPIO13_OE                                    PDS_CR_PDS_GPIO13_OE
#define PDS_CR_PDS_GPIO13_OE_POS                                (13U)
#define PDS_CR_PDS_GPIO13_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO13_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO13_OE_LEN)-1)<<PDS_CR_PDS_GPIO13_OE_POS)
#define PDS_CR_PDS_GPIO13_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO13_OE_LEN)-1)<<PDS_CR_PDS_GPIO13_OE_POS))
#define PDS_CR_PDS_GPIO14_OE                                    PDS_CR_PDS_GPIO14_OE
#define PDS_CR_PDS_GPIO14_OE_POS                                (14U)
#define PDS_CR_PDS_GPIO14_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO14_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO14_OE_LEN)-1)<<PDS_CR_PDS_GPIO14_OE_POS)
#define PDS_CR_PDS_GPIO14_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO14_OE_LEN)-1)<<PDS_CR_PDS_GPIO14_OE_POS))
#define PDS_CR_PDS_GPIO15_OE                                    PDS_CR_PDS_GPIO15_OE
#define PDS_CR_PDS_GPIO15_OE_POS                                (15U)
#define PDS_CR_PDS_GPIO15_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO15_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO15_OE_LEN)-1)<<PDS_CR_PDS_GPIO15_OE_POS)
#define PDS_CR_PDS_GPIO15_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO15_OE_LEN)-1)<<PDS_CR_PDS_GPIO15_OE_POS))
#define PDS_CR_PDS_GPIO16_OE                                    PDS_CR_PDS_GPIO16_OE
#define PDS_CR_PDS_GPIO16_OE_POS                                (16U)
#define PDS_CR_PDS_GPIO16_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO16_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO16_OE_LEN)-1)<<PDS_CR_PDS_GPIO16_OE_POS)
#define PDS_CR_PDS_GPIO16_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO16_OE_LEN)-1)<<PDS_CR_PDS_GPIO16_OE_POS))
#define PDS_CR_PDS_GPIO17_OE                                    PDS_CR_PDS_GPIO17_OE
#define PDS_CR_PDS_GPIO17_OE_POS                                (17U)
#define PDS_CR_PDS_GPIO17_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO17_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO17_OE_LEN)-1)<<PDS_CR_PDS_GPIO17_OE_POS)
#define PDS_CR_PDS_GPIO17_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO17_OE_LEN)-1)<<PDS_CR_PDS_GPIO17_OE_POS))
#define PDS_CR_PDS_GPIO18_OE                                    PDS_CR_PDS_GPIO18_OE
#define PDS_CR_PDS_GPIO18_OE_POS                                (18U)
#define PDS_CR_PDS_GPIO18_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO18_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO18_OE_LEN)-1)<<PDS_CR_PDS_GPIO18_OE_POS)
#define PDS_CR_PDS_GPIO18_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO18_OE_LEN)-1)<<PDS_CR_PDS_GPIO18_OE_POS))
#define PDS_CR_PDS_GPIO19_OE                                    PDS_CR_PDS_GPIO19_OE
#define PDS_CR_PDS_GPIO19_OE_POS                                (19U)
#define PDS_CR_PDS_GPIO19_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO19_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO19_OE_LEN)-1)<<PDS_CR_PDS_GPIO19_OE_POS)
#define PDS_CR_PDS_GPIO19_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO19_OE_LEN)-1)<<PDS_CR_PDS_GPIO19_OE_POS))
#define PDS_CR_PDS_GPIO20_OE                                    PDS_CR_PDS_GPIO20_OE
#define PDS_CR_PDS_GPIO20_OE_POS                                (20U)
#define PDS_CR_PDS_GPIO20_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO20_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO20_OE_LEN)-1)<<PDS_CR_PDS_GPIO20_OE_POS)
#define PDS_CR_PDS_GPIO20_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO20_OE_LEN)-1)<<PDS_CR_PDS_GPIO20_OE_POS))
#define PDS_CR_PDS_GPIO21_OE                                    PDS_CR_PDS_GPIO21_OE
#define PDS_CR_PDS_GPIO21_OE_POS                                (21U)
#define PDS_CR_PDS_GPIO21_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO21_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO21_OE_LEN)-1)<<PDS_CR_PDS_GPIO21_OE_POS)
#define PDS_CR_PDS_GPIO21_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO21_OE_LEN)-1)<<PDS_CR_PDS_GPIO21_OE_POS))
#define PDS_CR_PDS_GPIO22_OE                                    PDS_CR_PDS_GPIO22_OE
#define PDS_CR_PDS_GPIO22_OE_POS                                (22U)
#define PDS_CR_PDS_GPIO22_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO22_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO22_OE_LEN)-1)<<PDS_CR_PDS_GPIO22_OE_POS)
#define PDS_CR_PDS_GPIO22_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO22_OE_LEN)-1)<<PDS_CR_PDS_GPIO22_OE_POS))
#define PDS_CR_PDS_GPIO23_OE                                    PDS_CR_PDS_GPIO23_OE
#define PDS_CR_PDS_GPIO23_OE_POS                                (23U)
#define PDS_CR_PDS_GPIO23_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO23_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO23_OE_LEN)-1)<<PDS_CR_PDS_GPIO23_OE_POS)
#define PDS_CR_PDS_GPIO23_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO23_OE_LEN)-1)<<PDS_CR_PDS_GPIO23_OE_POS))
#define PDS_CR_PDS_GPIO24_OE                                    PDS_CR_PDS_GPIO24_OE
#define PDS_CR_PDS_GPIO24_OE_POS                                (24U)
#define PDS_CR_PDS_GPIO24_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO24_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO24_OE_LEN)-1)<<PDS_CR_PDS_GPIO24_OE_POS)
#define PDS_CR_PDS_GPIO24_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO24_OE_LEN)-1)<<PDS_CR_PDS_GPIO24_OE_POS))
#define PDS_CR_PDS_GPIO25_OE                                    PDS_CR_PDS_GPIO25_OE
#define PDS_CR_PDS_GPIO25_OE_POS                                (25U)
#define PDS_CR_PDS_GPIO25_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO25_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO25_OE_LEN)-1)<<PDS_CR_PDS_GPIO25_OE_POS)
#define PDS_CR_PDS_GPIO25_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO25_OE_LEN)-1)<<PDS_CR_PDS_GPIO25_OE_POS))
#define PDS_CR_PDS_GPIO26_OE                                    PDS_CR_PDS_GPIO26_OE
#define PDS_CR_PDS_GPIO26_OE_POS                                (26U)
#define PDS_CR_PDS_GPIO26_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO26_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO26_OE_LEN)-1)<<PDS_CR_PDS_GPIO26_OE_POS)
#define PDS_CR_PDS_GPIO26_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO26_OE_LEN)-1)<<PDS_CR_PDS_GPIO26_OE_POS))
#define PDS_CR_PDS_GPIO27_OE                                    PDS_CR_PDS_GPIO27_OE
#define PDS_CR_PDS_GPIO27_OE_POS                                (27U)
#define PDS_CR_PDS_GPIO27_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO27_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO27_OE_LEN)-1)<<PDS_CR_PDS_GPIO27_OE_POS)
#define PDS_CR_PDS_GPIO27_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO27_OE_LEN)-1)<<PDS_CR_PDS_GPIO27_OE_POS))
#define PDS_CR_PDS_GPIO28_OE                                    PDS_CR_PDS_GPIO28_OE
#define PDS_CR_PDS_GPIO28_OE_POS                                (28U)
#define PDS_CR_PDS_GPIO28_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO28_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO28_OE_LEN)-1)<<PDS_CR_PDS_GPIO28_OE_POS)
#define PDS_CR_PDS_GPIO28_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO28_OE_LEN)-1)<<PDS_CR_PDS_GPIO28_OE_POS))
#define PDS_CR_PDS_GPIO29_OE                                    PDS_CR_PDS_GPIO29_OE
#define PDS_CR_PDS_GPIO29_OE_POS                                (29U)
#define PDS_CR_PDS_GPIO29_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO29_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO29_OE_LEN)-1)<<PDS_CR_PDS_GPIO29_OE_POS)
#define PDS_CR_PDS_GPIO29_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO29_OE_LEN)-1)<<PDS_CR_PDS_GPIO29_OE_POS))
#define PDS_CR_PDS_GPIO30_OE                                    PDS_CR_PDS_GPIO30_OE
#define PDS_CR_PDS_GPIO30_OE_POS                                (30U)
#define PDS_CR_PDS_GPIO30_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO30_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO30_OE_LEN)-1)<<PDS_CR_PDS_GPIO30_OE_POS)
#define PDS_CR_PDS_GPIO30_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO30_OE_LEN)-1)<<PDS_CR_PDS_GPIO30_OE_POS))
#define PDS_CR_PDS_GPIO31_OE                                    PDS_CR_PDS_GPIO31_OE
#define PDS_CR_PDS_GPIO31_OE_POS                                (31U)
#define PDS_CR_PDS_GPIO31_OE_LEN                                (1U)
#define PDS_CR_PDS_GPIO31_OE_MSK                                (((1U<<PDS_CR_PDS_GPIO31_OE_LEN)-1)<<PDS_CR_PDS_GPIO31_OE_POS)
#define PDS_CR_PDS_GPIO31_OE_UMSK                               (~(((1U<<PDS_CR_PDS_GPIO31_OE_LEN)-1)<<PDS_CR_PDS_GPIO31_OE_POS))

