bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/pds_reg.h
/* 0x40 : pds_gpio_int_set */
#define PDS_GPIO_INT_SET_OFFSET                                 (0x40)
#define PDS_GPIO_SET0_INT_MODE                                  PDS_GPIO_SET0_INT_MODE
#define PDS_GPIO_SET0_INT_MODE_POS                              (0U)
#define PDS_GPIO_SET0_INT_MODE_LEN                              (4U)
#define PDS_GPIO_SET0_INT_MODE_MSK                              (((1U<<PDS_GPIO_SET0_INT_MODE_LEN)-1)<<PDS_GPIO_SET0_INT_MODE_POS)
#define PDS_GPIO_SET0_INT_MODE_UMSK                             (~(((1U<<PDS_GPIO_SET0_INT_MODE_LEN)-1)<<PDS_GPIO_SET0_INT_MODE_POS))
#define PDS_GPIO_SET1_INT_MODE                                  PDS_GPIO_SET1_INT_MODE
#define PDS_GPIO_SET1_INT_MODE_POS                              (4U)
#define PDS_GPIO_SET1_INT_MODE_LEN                              (4U)
#define PDS_GPIO_SET1_INT_MODE_MSK                              (((1U<<PDS_GPIO_SET1_INT_MODE_LEN)-1)<<PDS_GPIO_SET1_INT_MODE_POS)
#define PDS_GPIO_SET1_INT_MODE_UMSK                             (~(((1U<<PDS_GPIO_SET1_INT_MODE_LEN)-1)<<PDS_GPIO_SET1_INT_MODE_POS))
#define PDS_GPIO_SET2_INT_MODE                                  PDS_GPIO_SET2_INT_MODE
#define PDS_GPIO_SET2_INT_MODE_POS                              (8U)
#define PDS_GPIO_SET2_INT_MODE_LEN                              (4U)
#define PDS_GPIO_SET2_INT_MODE_MSK                              (((1U<<PDS_GPIO_SET2_INT_MODE_LEN)-1)<<PDS_GPIO_SET2_INT_MODE_POS)
#define PDS_GPIO_SET2_INT_MODE_UMSK                             (~(((1U<<PDS_GPIO_SET2_INT_MODE_LEN)-1)<<PDS_GPIO_SET2_INT_MODE_POS))
#define PDS_GPIO_SET3_INT_MODE                                  PDS_GPIO_SET3_INT_MODE
#define PDS_GPIO_SET3_INT_MODE_POS                              (12U)
#define PDS_GPIO_SET3_INT_MODE_LEN                              (4U)
#define PDS_GPIO_SET3_INT_MODE_MSK                              (((1U<<PDS_GPIO_SET3_INT_MODE_LEN)-1)<<PDS_GPIO_SET3_INT_MODE_POS)
#define PDS_GPIO_SET3_INT_MODE_UMSK                             (~(((1U<<PDS_GPIO_SET3_INT_MODE_LEN)-1)<<PDS_GPIO_SET3_INT_MODE_POS))
#define PDS_GPIO_SET4_INT_MODE                                  PDS_GPIO_SET4_INT_MODE
#define PDS_GPIO_SET4_INT_MODE_POS                              (16U)
#define PDS_GPIO_SET4_INT_MODE_LEN                              (4U)
#define PDS_GPIO_SET4_INT_MODE_MSK                              (((1U<<PDS_GPIO_SET4_INT_MODE_LEN)-1)<<PDS_GPIO_SET4_INT_MODE_POS)
#define PDS_GPIO_SET4_INT_MODE_UMSK                             (~(((1U<<PDS_GPIO_SET4_INT_MODE_LEN)-1)<<PDS_GPIO_SET4_INT_MODE_POS))
#define PDS_GPIO_SET5_INT_MODE                                  PDS_GPIO_SET5_INT_MODE
#define PDS_GPIO_SET5_INT_MODE_POS                              (20U)
#define PDS_GPIO_SET5_INT_MODE_LEN                              (4U)
#define PDS_GPIO_SET5_INT_MODE_MSK                              (((1U<<PDS_GPIO_SET5_INT_MODE_LEN)-1)<<PDS_GPIO_SET5_INT_MODE_POS)
#define PDS_GPIO_SET5_INT_MODE_UMSK                             (~(((1U<<PDS_GPIO_SET5_INT_MODE_LEN)-1)<<PDS_GPIO_SET5_INT_MODE_POS))
#define PDS_GPIO_SET6_INT_MODE                                  PDS_GPIO_SET6_INT_MODE
#define PDS_GPIO_SET6_INT_MODE_POS                              (24U)
#define PDS_GPIO_SET6_INT_MODE_LEN                              (4U)
#define PDS_GPIO_SET6_INT_MODE_MSK                              (((1U<<PDS_GPIO_SET6_INT_MODE_LEN)-1)<<PDS_GPIO_SET6_INT_MODE_POS)
#define PDS_GPIO_SET6_INT_MODE_UMSK                             (~(((1U<<PDS_GPIO_SET6_INT_MODE_LEN)-1)<<PDS_GPIO_SET6_INT_MODE_POS))
#define PDS_GPIO_SET7_INT_MODE                                  PDS_GPIO_SET7_INT_MODE
#define PDS_GPIO_SET7_INT_MODE_POS                              (28U)
#define PDS_GPIO_SET7_INT_MODE_LEN                              (4U)
#define PDS_GPIO_SET7_INT_MODE_MSK                              (((1U<<PDS_GPIO_SET7_INT_MODE_LEN)-1)<<PDS_GPIO_SET7_INT_MODE_POS)
#define PDS_GPIO_SET7_INT_MODE_UMSK                             (~(((1U<<PDS_GPIO_SET7_INT_MODE_LEN)-1)<<PDS_GPIO_SET7_INT_MODE_POS))

/* 0x44 : pds_gpio_stat */
#define PDS_GPIO_STAT_OFFSET                                    (0x44)
#define PDS_GPIO_INT_STAT                                       PDS_GPIO_INT_STAT
#define PDS_GPIO_INT_STAT_POS                                   (0U)
#define PDS_GPIO_INT_STAT_LEN                                   (32U)
#define PDS_GPIO_INT_STAT_MSK                                   (((1U<<PDS_GPIO_INT_STAT_LEN)-1)<<PDS_GPIO_INT_STAT_POS)
#define PDS_GPIO_INT_STAT_UMSK                                  (~(((1U<<PDS_GPIO_INT_STAT_LEN)-1)<<PDS_GPIO_INT_STAT_POS))

/* 0x48 : cfg_pds_key_scan */
#define PDS_CFG_PDS_KEY_SCAN_OFFSET                             (0x48)
#define PDS_CR_PDS_GPIO_SET_O_VAL                               PDS_CR_PDS_GPIO_SET_O_VAL
#define PDS_CR_PDS_GPIO_SET_O_VAL_POS                           (0U)
#define PDS_CR_PDS_GPIO_SET_O_VAL_LEN                           (8U)
#define PDS_CR_PDS_GPIO_SET_O_VAL_MSK                           (((1U<<PDS_CR_PDS_GPIO_SET_O_VAL_LEN)-1)<<PDS_CR_PDS_GPIO_SET_O_VAL_POS)
#define PDS_CR_PDS_GPIO_SET_O_VAL_UMSK                          (~(((1U<<PDS_CR_PDS_GPIO_SET_O_VAL_LEN)-1)<<PDS_CR_PDS_GPIO_SET_O_VAL_POS))
#define PDS_CR_PDS_GPIO_SET_INT_MASK                            PDS_CR_PDS_GPIO_SET_INT_MASK
#define PDS_CR_PDS_GPIO_SET_INT_MASK_POS                        (8U)
#define PDS_CR_PDS_GPIO_SET_INT_MASK_LEN                        (8U)
#define PDS_CR_PDS_GPIO_SET_INT_MASK_MSK                        (((1U<<PDS_CR_PDS_GPIO_SET_INT_MASK_LEN)-1)<<PDS_CR_PDS_GPIO_SET_INT_MASK_POS)
#define PDS_CR_PDS_GPIO_SET_INT_MASK_UMSK                       (~(((1U<<PDS_CR_PDS_GPIO_SET_INT_MASK_LEN)-1)<<PDS_CR_PDS_GPIO_SET_INT_MASK_POS))
#define PDS_CR_PDS_GPIO0_SET_INT_CLR                            PDS_CR_PDS_GPIO0_SET_INT_CLR
#define PDS_CR_PDS_GPIO0_SET_INT_CLR_POS                        (24U)
#define PDS_CR_PDS_GPIO0_SET_INT_CLR_LEN                        (1U)
#define PDS_CR_PDS_GPIO0_SET_INT_CLR_MSK                        (((1U<<PDS_CR_PDS_GPIO0_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO0_SET_INT_CLR_POS)
#define PDS_CR_PDS_GPIO0_SET_INT_CLR_UMSK                       (~(((1U<<PDS_CR_PDS_GPIO0_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO0_SET_INT_CLR_POS))
#define PDS_CR_PDS_GPIO1_SET_INT_CLR                            PDS_CR_PDS_GPIO1_SET_INT_CLR
#define PDS_CR_PDS_GPIO1_SET_INT_CLR_POS                        (25U)
#define PDS_CR_PDS_GPIO1_SET_INT_CLR_LEN                        (1U)
#define PDS_CR_PDS_GPIO1_SET_INT_CLR_MSK                        (((1U<<PDS_CR_PDS_GPIO1_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO1_SET_INT_CLR_POS)
#define PDS_CR_PDS_GPIO1_SET_INT_CLR_UMSK                       (~(((1U<<PDS_CR_PDS_GPIO1_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO1_SET_INT_CLR_POS))
#define PDS_CR_PDS_GPIO2_SET_INT_CLR                            PDS_CR_PDS_GPIO2_SET_INT_CLR
#define PDS_CR_PDS_GPIO2_SET_INT_CLR_POS                        (26U)
#define PDS_CR_PDS_GPIO2_SET_INT_CLR_LEN                        (1U)
#define PDS_CR_PDS_GPIO2_SET_INT_CLR_MSK                        (((1U<<PDS_CR_PDS_GPIO2_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO2_SET_INT_CLR_POS)
#define PDS_CR_PDS_GPIO2_SET_INT_CLR_UMSK                       (~(((1U<<PDS_CR_PDS_GPIO2_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO2_SET_INT_CLR_POS))
#define PDS_CR_PDS_GPIO3_SET_INT_CLR                            PDS_CR_PDS_GPIO3_SET_INT_CLR
#define PDS_CR_PDS_GPIO3_SET_INT_CLR_POS                        (27U)
#define PDS_CR_PDS_GPIO3_SET_INT_CLR_LEN                        (1U)
#define PDS_CR_PDS_GPIO3_SET_INT_CLR_MSK                        (((1U<<PDS_CR_PDS_GPIO3_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO3_SET_INT_CLR_POS)
#define PDS_CR_PDS_GPIO3_SET_INT_CLR_UMSK                       (~(((1U<<PDS_CR_PDS_GPIO3_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO3_SET_INT_CLR_POS))
#define PDS_CR_PDS_GPIO4_SET_INT_CLR                            PDS_CR_PDS_GPIO4_SET_INT_CLR
#define PDS_CR_PDS_GPIO4_SET_INT_CLR_POS                        (28U)
#define PDS_CR_PDS_GPIO4_SET_INT_CLR_LEN                        (1U)
#define PDS_CR_PDS_GPIO4_SET_INT_CLR_MSK                        (((1U<<PDS_CR_PDS_GPIO4_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO4_SET_INT_CLR_POS)
#define PDS_CR_PDS_GPIO4_SET_INT_CLR_UMSK                       (~(((1U<<PDS_CR_PDS_GPIO4_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO4_SET_INT_CLR_POS))
#define PDS_CR_PDS_GPIO5_SET_INT_CLR                            PDS_CR_PDS_GPIO5_SET_INT_CLR
#define PDS_CR_PDS_GPIO5_SET_INT_CLR_POS                        (29U)
#define PDS_CR_PDS_GPIO5_SET_INT_CLR_LEN                        (1U)
#define PDS_CR_PDS_GPIO5_SET_INT_CLR_MSK                        (((1U<<PDS_CR_PDS_GPIO5_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO5_SET_INT_CLR_POS)
#define PDS_CR_PDS_GPIO5_SET_INT_CLR_UMSK                       (~(((1U<<PDS_CR_PDS_GPIO5_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO5_SET_INT_CLR_POS))
#define PDS_CR_PDS_GPIO6_SET_INT_CLR                            PDS_CR_PDS_GPIO6_SET_INT_CLR
#define PDS_CR_PDS_GPIO6_SET_INT_CLR_POS                        (30U)
#define PDS_CR_PDS_GPIO6_SET_INT_CLR_LEN                        (1U)
#define PDS_CR_PDS_GPIO6_SET_INT_CLR_MSK                        (((1U<<PDS_CR_PDS_GPIO6_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO6_SET_INT_CLR_POS)
#define PDS_CR_PDS_GPIO6_SET_INT_CLR_UMSK                       (~(((1U<<PDS_CR_PDS_GPIO6_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO6_SET_INT_CLR_POS))
#define PDS_CR_PDS_GPIO7_SET_INT_CLR                            PDS_CR_PDS_GPIO7_SET_INT_CLR
#define PDS_CR_PDS_GPIO7_SET_INT_CLR_POS                        (31U)
#define PDS_CR_PDS_GPIO7_SET_INT_CLR_LEN                        (1U)
#define PDS_CR_PDS_GPIO7_SET_INT_CLR_MSK                        (((1U<<PDS_CR_PDS_GPIO7_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO7_SET_INT_CLR_POS)
#define PDS_CR_PDS_GPIO7_SET_INT_CLR_UMSK                       (~(((1U<<PDS_CR_PDS_GPIO7_SET_INT_CLR_LEN)-1)<<PDS_CR_PDS_GPIO7_SET_INT_CLR_POS))

/* 0x4C : XTAL_CNT_32K */
#define PDS_XTAL_CNT_32K_OFFSET                                 (0x4C)
#define PDS_RO_XTAL_CNT_32K_RES                                 PDS_RO_XTAL_CNT_32K_RES
#define PDS_RO_XTAL_CNT_32K_RES_POS                             (0U)
#define PDS_RO_XTAL_CNT_32K_RES_LEN                             (6U)
#define PDS_RO_XTAL_CNT_32K_RES_MSK                             (((1U<<PDS_RO_XTAL_CNT_32K_RES_LEN)-1)<<PDS_RO_XTAL_CNT_32K_RES_POS)
#define PDS_RO_XTAL_CNT_32K_RES_UMSK                            (~(((1U<<PDS_RO_XTAL_CNT_32K_RES_LEN)-1)<<PDS_RO_XTAL_CNT_32K_RES_POS))
#define PDS_RO_XTAL_CNT_32K_CNT                                 PDS_RO_XTAL_CNT_32K_CNT
#define PDS_RO_XTAL_CNT_32K_CNT_POS                             (6U)
#define PDS_RO_XTAL_CNT_32K_CNT_LEN                             (11U)
#define PDS_RO_XTAL_CNT_32K_CNT_MSK                             (((1U<<PDS_RO_XTAL_CNT_32K_CNT_LEN)-1)<<PDS_RO_XTAL_CNT_32K_CNT_POS)
#define PDS_RO_XTAL_CNT_32K_CNT_UMSK                            (~(((1U<<PDS_RO_XTAL_CNT_32K_CNT_LEN)-1)<<PDS_RO_XTAL_CNT_32K_CNT_POS))
#define PDS_REG_TOTAL_32K_CYCLE                                 PDS_REG_TOTAL_32K_CYCLE
#define PDS_REG_TOTAL_32K_CYCLE_POS                             (17U)
#define PDS_REG_TOTAL_32K_CYCLE_LEN                             (3U)
#define PDS_REG_TOTAL_32K_CYCLE_MSK                             (((1U<<PDS_REG_TOTAL_32K_CYCLE_LEN)-1)<<PDS_REG_TOTAL_32K_CYCLE_POS)
#define PDS_REG_TOTAL_32K_CYCLE_UMSK                            (~(((1U<<PDS_REG_TOTAL_32K_CYCLE_LEN)-1)<<PDS_REG_TOTAL_32K_CYCLE_POS))
#define PDS_XTAL_CNT_32K_PROCESS                                PDS_XTAL_CNT_32K_PROCESS
#define PDS_XTAL_CNT_32K_PROCESS_POS                            (29U)
#define PDS_XTAL_CNT_32K_PROCESS_LEN                            (1U)
#define PDS_XTAL_CNT_32K_PROCESS_MSK                            (((1U<<PDS_XTAL_CNT_32K_PROCESS_LEN)-1)<<PDS_XTAL_CNT_32K_PROCESS_POS)
#define PDS_XTAL_CNT_32K_PROCESS_UMSK                           (~(((1U<<PDS_XTAL_CNT_32K_PROCESS_LEN)-1)<<PDS_XTAL_CNT_32K_PROCESS_POS))
#define PDS_XTAL_CNT_32K_DONE                                   PDS_XTAL_CNT_32K_DONE
#define PDS_XTAL_CNT_32K_DONE_POS                               (30U)
#define PDS_XTAL_CNT_32K_DONE_LEN                               (1U)
#define PDS_XTAL_CNT_32K_DONE_MSK                               (((1U<<PDS_XTAL_CNT_32K_DONE_LEN)-1)<<PDS_XTAL_CNT_32K_DONE_POS)
#define PDS_XTAL_CNT_32K_DONE_UMSK                              (~(((1U<<PDS_XTAL_CNT_32K_DONE_LEN)-1)<<PDS_XTAL_CNT_32K_DONE_POS))

/* 0x50 : PDS_KYD_CTL */
#define PDS_KYD_CTL_OFFSET                                      (0x50)
#define PDS_CR_PDS_KYD_EN                                       PDS_CR_PDS_KYD_EN
#define PDS_CR_PDS_KYD_EN_POS                                   (0U)
#define PDS_CR_PDS_KYD_EN_LEN                                   (1U)
#define PDS_CR_PDS_KYD_EN_MSK                                   (((1U<<PDS_CR_PDS_KYD_EN_LEN)-1)<<PDS_CR_PDS_KYD_EN_POS)
#define PDS_CR_PDS_KYD_EN_UMSK                                  (~(((1U<<PDS_CR_PDS_KYD_EN_LEN)-1)<<PDS_CR_PDS_KYD_EN_POS))
#define PDS_CR_PDS_KYD_COL_O_VAL                                PDS_CR_PDS_KYD_COL_O_VAL
#define PDS_CR_PDS_KYD_COL_O_VAL_POS                            (1U)
#define PDS_CR_PDS_KYD_COL_O_VAL_LEN                            (1U)
#define PDS_CR_PDS_KYD_COL_O_VAL_MSK                            (((1U<<PDS_CR_PDS_KYD_COL_O_VAL_LEN)-1)<<PDS_CR_PDS_KYD_COL_O_VAL_POS)
#define PDS_CR_PDS_KYD_COL_O_VAL_UMSK                           (~(((1U<<PDS_CR_PDS_KYD_COL_O_VAL_LEN)-1)<<PDS_CR_PDS_KYD_COL_O_VAL_POS))
#define PDS_CR_PDS_KYD_ROW_MATRIX_SIZE                          PDS_CR_PDS_KYD_ROW_MATRIX_SIZE
#define PDS_CR_PDS_KYD_ROW_MATRIX_SIZE_POS                      (2U)
#define PDS_CR_PDS_KYD_ROW_MATRIX_SIZE_LEN                      (3U)
#define PDS_CR_PDS_KYD_ROW_MATRIX_SIZE_MSK                      (((1U<<PDS_CR_PDS_KYD_ROW_MATRIX_SIZE_LEN)-1)<<PDS_CR_PDS_KYD_ROW_MATRIX_SIZE_POS)
#define PDS_CR_PDS_KYD_ROW_MATRIX_SIZE_UMSK                     (~(((1U<<PDS_CR_PDS_KYD_ROW_MATRIX_SIZE_LEN)-1)<<PDS_CR_PDS_KYD_ROW_MATRIX_SIZE_POS))
#define PDS_CR_PDS_KYD_COL_MATRIX_SIZE                          PDS_CR_PDS_KYD_COL_MATRIX_SIZE
#define PDS_CR_PDS_KYD_COL_MATRIX_SIZE_POS                      (5U)
#define PDS_CR_PDS_KYD_COL_MATRIX_SIZE_LEN                      (3U)
#define PDS_CR_PDS_KYD_COL_MATRIX_SIZE_MSK                      (((1U<<PDS_CR_PDS_KYD_COL_MATRIX_SIZE_LEN)-1)<<PDS_CR_PDS_KYD_COL_MATRIX_SIZE_POS)
#define PDS_CR_PDS_KYD_COL_MATRIX_SIZE_UMSK                     (~(((1U<<PDS_CR_PDS_KYD_COL_MATRIX_SIZE_LEN)-1)<<PDS_CR_PDS_KYD_COL_MATRIX_SIZE_POS))
#define PDS_CR_PDS_KYD_ROW_I_PULL_EN                            PDS_CR_PDS_KYD_ROW_I_PULL_EN
#define PDS_CR_PDS_KYD_ROW_I_PULL_EN_POS                        (8U)
#define PDS_CR_PDS_KYD_ROW_I_PULL_EN_LEN                        (1U)
#define PDS_CR_PDS_KYD_ROW_I_PULL_EN_MSK                        (((1U<<PDS_CR_PDS_KYD_ROW_I_PULL_EN_LEN)-1)<<PDS_CR_PDS_KYD_ROW_I_PULL_EN_POS)
#define PDS_CR_PDS_KYD_ROW_I_PULL_EN_UMSK                       (~(((1U<<PDS_CR_PDS_KYD_ROW_I_PULL_EN_LEN)-1)<<PDS_CR_PDS_KYD_ROW_I_PULL_EN_POS))
#define PDS_RO_PDS_KYD_WAKEUP                                   PDS_RO_PDS_KYD_WAKEUP
#define PDS_RO_PDS_KYD_WAKEUP_POS                               (9U)
#define PDS_RO_PDS_KYD_WAKEUP_LEN                               (1U)
#define PDS_RO_PDS_KYD_WAKEUP_MSK                               (((1U<<PDS_RO_PDS_KYD_WAKEUP_LEN)-1)<<PDS_RO_PDS_KYD_WAKEUP_POS)
#define PDS_RO_PDS_KYD_WAKEUP_UMSK                              (~(((1U<<PDS_RO_PDS_KYD_WAKEUP_LEN)-1)<<PDS_RO_PDS_KYD_WAKEUP_POS))
#define PDS_CLR_PDS_KYD_WAKEUP                                  PDS_CLR_PDS_KYD_WAKEUP
#define PDS_CLR_PDS_KYD_WAKEUP_POS                              (10U)
#define PDS_CLR_PDS_KYD_WAKEUP_LEN                              (1U)
#define PDS_CLR_PDS_KYD_WAKEUP_MSK                              (((1U<<PDS_CLR_PDS_KYD_WAKEUP_LEN)-1)<<PDS_CLR_PDS_KYD_WAKEUP_POS)
#define PDS_CLR_PDS_KYD_WAKEUP_UMSK                             (~(((1U<<PDS_CLR_PDS_KYD_WAKEUP_LEN)-1)<<PDS_CLR_PDS_KYD_WAKEUP_POS))
#define PDS_RO_PDS_KYD_WAKEUP_ROW_GPIO                          PDS_RO_PDS_KYD_WAKEUP_ROW_GPIO
#define PDS_RO_PDS_KYD_WAKEUP_ROW_GPIO_POS                      (16U)
#define PDS_RO_PDS_KYD_WAKEUP_ROW_GPIO_LEN                      (5U)
#define PDS_RO_PDS_KYD_WAKEUP_ROW_GPIO_MSK                      (((1U<<PDS_RO_PDS_KYD_WAKEUP_ROW_GPIO_LEN)-1)<<PDS_RO_PDS_KYD_WAKEUP_ROW_GPIO_POS)
#define PDS_RO_PDS_KYD_WAKEUP_ROW_GPIO_UMSK                     (~(((1U<<PDS_RO_PDS_KYD_WAKEUP_ROW_GPIO_LEN)-1)<<PDS_RO_PDS_KYD_WAKEUP_ROW_GPIO_POS))
#define PDS_RO_PDS_KYD_WAKEUP_ROW_INDEX                         PDS_RO_PDS_KYD_WAKEUP_ROW_INDEX
#define PDS_RO_PDS_KYD_WAKEUP_ROW_INDEX_POS                     (21U)
#define PDS_RO_PDS_KYD_WAKEUP_ROW_INDEX_LEN                     (3U)
#define PDS_RO_PDS_KYD_WAKEUP_ROW_INDEX_MSK                     (((1U<<PDS_RO_PDS_KYD_WAKEUP_ROW_INDEX_LEN)-1)<<PDS_RO_PDS_KYD_WAKEUP_ROW_INDEX_POS)
#define PDS_RO_PDS_KYD_WAKEUP_ROW_INDEX_UMSK                    (~(((1U<<PDS_RO_PDS_KYD_WAKEUP_ROW_INDEX_LEN)-1)<<PDS_RO_PDS_KYD_WAKEUP_ROW_INDEX_POS))
#define PDS_RO_PDS_KYD_WAKEUP_COL_GPIO                          PDS_RO_PDS_KYD_WAKEUP_COL_GPIO
#define PDS_RO_PDS_KYD_WAKEUP_COL_GPIO_POS                      (24U)
#define PDS_RO_PDS_KYD_WAKEUP_COL_GPIO_LEN                      (5U)
#define PDS_RO_PDS_KYD_WAKEUP_COL_GPIO_MSK                      (((1U<<PDS_RO_PDS_KYD_WAKEUP_COL_GPIO_LEN)-1)<<PDS_RO_PDS_KYD_WAKEUP_COL_GPIO_POS)
#define PDS_RO_PDS_KYD_WAKEUP_COL_GPIO_UMSK                     (~(((1U<<PDS_RO_PDS_KYD_WAKEUP_COL_GPIO_LEN)-1)<<PDS_RO_PDS_KYD_WAKEUP_COL_GPIO_POS))
#define PDS_RO_PDS_KYD_WAKEUP_COL_INDEX                         PDS_RO_PDS_KYD_WAKEUP_COL_INDEX
#define PDS_RO_PDS_KYD_WAKEUP_COL_INDEX_POS                     (29U)
#define PDS_RO_PDS_KYD_WAKEUP_COL_INDEX_LEN                     (3U)
#define PDS_RO_PDS_KYD_WAKEUP_COL_INDEX_MSK                     (((1U<<PDS_RO_PDS_KYD_WAKEUP_COL_INDEX_LEN)-1)<<PDS_RO_PDS_KYD_WAKEUP_COL_INDEX_POS)
#define PDS_RO_PDS_KYD_WAKEUP_COL_INDEX_UMSK                    (~(((1U<<PDS_RO_PDS_KYD_WAKEUP_COL_INDEX_LEN)-1)<<PDS_RO_PDS_KYD_WAKEUP_COL_INDEX_POS))

