bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/pds_reg.h
/* 0x54 : PDS_KYD_WHITE_SET */
#define PDS_KYD_WHITE_SET_OFFSET                                (0x54)
#define PDS_CFG_WHITE_KEY0_ROW_INDEX                            PDS_CFG_WHITE_KEY0_ROW_INDEX
#define PDS_CFG_WHITE_KEY0_ROW_INDEX_POS                        (0U)
#define PDS_CFG_WHITE_KEY0_ROW_INDEX_LEN                        (3U)
#define PDS_CFG_WHITE_KEY0_ROW_INDEX_MSK                        (((1U<<PDS_CFG_WHITE_KEY0_ROW_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY0_ROW_INDEX_POS)
#define PDS_CFG_WHITE_KEY0_ROW_INDEX_UMSK                       (~(((1U<<PDS_CFG_WHITE_KEY0_ROW_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY0_ROW_INDEX_POS))
#define PDS_CFG_WHITE_KEY0_COL_INDEX                            PDS_CFG_WHITE_KEY0_COL_INDEX
#define PDS_CFG_WHITE_KEY0_COL_INDEX_POS                        (3U)
#define PDS_CFG_WHITE_KEY0_COL_INDEX_LEN                        (3U)
#define PDS_CFG_WHITE_KEY0_COL_INDEX_MSK                        (((1U<<PDS_CFG_WHITE_KEY0_COL_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY0_COL_INDEX_POS)
#define PDS_CFG_WHITE_KEY0_COL_INDEX_UMSK                       (~(((1U<<PDS_CFG_WHITE_KEY0_COL_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY0_COL_INDEX_POS))
#define PDS_CFG_WHITE_KEY0_KYD_MODE                             PDS_CFG_WHITE_KEY0_KYD_MODE
#define PDS_CFG_WHITE_KEY0_KYD_MODE_POS                         (6U)
#define PDS_CFG_WHITE_KEY0_KYD_MODE_LEN                         (2U)
#define PDS_CFG_WHITE_KEY0_KYD_MODE_MSK                         (((1U<<PDS_CFG_WHITE_KEY0_KYD_MODE_LEN)-1)<<PDS_CFG_WHITE_KEY0_KYD_MODE_POS)
#define PDS_CFG_WHITE_KEY0_KYD_MODE_UMSK                        (~(((1U<<PDS_CFG_WHITE_KEY0_KYD_MODE_LEN)-1)<<PDS_CFG_WHITE_KEY0_KYD_MODE_POS))
#define PDS_CFG_WHITE_KEY1_ROW_INDEX                            PDS_CFG_WHITE_KEY1_ROW_INDEX
#define PDS_CFG_WHITE_KEY1_ROW_INDEX_POS                        (8U)
#define PDS_CFG_WHITE_KEY1_ROW_INDEX_LEN                        (3U)
#define PDS_CFG_WHITE_KEY1_ROW_INDEX_MSK                        (((1U<<PDS_CFG_WHITE_KEY1_ROW_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY1_ROW_INDEX_POS)
#define PDS_CFG_WHITE_KEY1_ROW_INDEX_UMSK                       (~(((1U<<PDS_CFG_WHITE_KEY1_ROW_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY1_ROW_INDEX_POS))
#define PDS_CFG_WHITE_KEY1_COL_INDEX                            PDS_CFG_WHITE_KEY1_COL_INDEX
#define PDS_CFG_WHITE_KEY1_COL_INDEX_POS                        (11U)
#define PDS_CFG_WHITE_KEY1_COL_INDEX_LEN                        (3U)
#define PDS_CFG_WHITE_KEY1_COL_INDEX_MSK                        (((1U<<PDS_CFG_WHITE_KEY1_COL_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY1_COL_INDEX_POS)
#define PDS_CFG_WHITE_KEY1_COL_INDEX_UMSK                       (~(((1U<<PDS_CFG_WHITE_KEY1_COL_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY1_COL_INDEX_POS))
#define PDS_CFG_WHITE_KEY1_KYD_MODE                             PDS_CFG_WHITE_KEY1_KYD_MODE
#define PDS_CFG_WHITE_KEY1_KYD_MODE_POS                         (14U)
#define PDS_CFG_WHITE_KEY1_KYD_MODE_LEN                         (2U)
#define PDS_CFG_WHITE_KEY1_KYD_MODE_MSK                         (((1U<<PDS_CFG_WHITE_KEY1_KYD_MODE_LEN)-1)<<PDS_CFG_WHITE_KEY1_KYD_MODE_POS)
#define PDS_CFG_WHITE_KEY1_KYD_MODE_UMSK                        (~(((1U<<PDS_CFG_WHITE_KEY1_KYD_MODE_LEN)-1)<<PDS_CFG_WHITE_KEY1_KYD_MODE_POS))
#define PDS_CFG_WHITE_KEY2_ROW_INDEX                            PDS_CFG_WHITE_KEY2_ROW_INDEX
#define PDS_CFG_WHITE_KEY2_ROW_INDEX_POS                        (16U)
#define PDS_CFG_WHITE_KEY2_ROW_INDEX_LEN                        (3U)
#define PDS_CFG_WHITE_KEY2_ROW_INDEX_MSK                        (((1U<<PDS_CFG_WHITE_KEY2_ROW_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY2_ROW_INDEX_POS)
#define PDS_CFG_WHITE_KEY2_ROW_INDEX_UMSK                       (~(((1U<<PDS_CFG_WHITE_KEY2_ROW_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY2_ROW_INDEX_POS))
#define PDS_CFG_WHITE_KEY2_COL_INDEX                            PDS_CFG_WHITE_KEY2_COL_INDEX
#define PDS_CFG_WHITE_KEY2_COL_INDEX_POS                        (19U)
#define PDS_CFG_WHITE_KEY2_COL_INDEX_LEN                        (3U)
#define PDS_CFG_WHITE_KEY2_COL_INDEX_MSK                        (((1U<<PDS_CFG_WHITE_KEY2_COL_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY2_COL_INDEX_POS)
#define PDS_CFG_WHITE_KEY2_COL_INDEX_UMSK                       (~(((1U<<PDS_CFG_WHITE_KEY2_COL_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY2_COL_INDEX_POS))
#define PDS_CFG_WHITE_KEY2_KYD_MODE                             PDS_CFG_WHITE_KEY2_KYD_MODE
#define PDS_CFG_WHITE_KEY2_KYD_MODE_POS                         (22U)
#define PDS_CFG_WHITE_KEY2_KYD_MODE_LEN                         (2U)
#define PDS_CFG_WHITE_KEY2_KYD_MODE_MSK                         (((1U<<PDS_CFG_WHITE_KEY2_KYD_MODE_LEN)-1)<<PDS_CFG_WHITE_KEY2_KYD_MODE_POS)
#define PDS_CFG_WHITE_KEY2_KYD_MODE_UMSK                        (~(((1U<<PDS_CFG_WHITE_KEY2_KYD_MODE_LEN)-1)<<PDS_CFG_WHITE_KEY2_KYD_MODE_POS))
#define PDS_CFG_WHITE_KEY3_ROW_INDEX                            PDS_CFG_WHITE_KEY3_ROW_INDEX
#define PDS_CFG_WHITE_KEY3_ROW_INDEX_POS                        (24U)
#define PDS_CFG_WHITE_KEY3_ROW_INDEX_LEN                        (3U)
#define PDS_CFG_WHITE_KEY3_ROW_INDEX_MSK                        (((1U<<PDS_CFG_WHITE_KEY3_ROW_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY3_ROW_INDEX_POS)
#define PDS_CFG_WHITE_KEY3_ROW_INDEX_UMSK                       (~(((1U<<PDS_CFG_WHITE_KEY3_ROW_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY3_ROW_INDEX_POS))
#define PDS_CFG_WHITE_KEY3_COL_INDEX                            PDS_CFG_WHITE_KEY3_COL_INDEX
#define PDS_CFG_WHITE_KEY3_COL_INDEX_POS                        (27U)
#define PDS_CFG_WHITE_KEY3_COL_INDEX_LEN                        (3U)
#define PDS_CFG_WHITE_KEY3_COL_INDEX_MSK                        (((1U<<PDS_CFG_WHITE_KEY3_COL_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY3_COL_INDEX_POS)
#define PDS_CFG_WHITE_KEY3_COL_INDEX_UMSK                       (~(((1U<<PDS_CFG_WHITE_KEY3_COL_INDEX_LEN)-1)<<PDS_CFG_WHITE_KEY3_COL_INDEX_POS))
#define PDS_CFG_WHITE_KEY3_KYD_MODE                             PDS_CFG_WHITE_KEY3_KYD_MODE
#define PDS_CFG_WHITE_KEY3_KYD_MODE_POS                         (30U)
#define PDS_CFG_WHITE_KEY3_KYD_MODE_LEN                         (2U)
#define PDS_CFG_WHITE_KEY3_KYD_MODE_MSK                         (((1U<<PDS_CFG_WHITE_KEY3_KYD_MODE_LEN)-1)<<PDS_CFG_WHITE_KEY3_KYD_MODE_POS)
#define PDS_CFG_WHITE_KEY3_KYD_MODE_UMSK                        (~(((1U<<PDS_CFG_WHITE_KEY3_KYD_MODE_LEN)-1)<<PDS_CFG_WHITE_KEY3_KYD_MODE_POS))

/* 0x60 : KYS_ROW_I_GPIO_SEL0 */
#define PDS_KYS_ROW_I_GPIO_SEL0_OFFSET                          (0x60)
#define PDS_CFG_KEY_ROW_I_0_GPIO_SEL                            PDS_CFG_KEY_ROW_I_0_GPIO_SEL
#define PDS_CFG_KEY_ROW_I_0_GPIO_SEL_POS                        (0U)
#define PDS_CFG_KEY_ROW_I_0_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_ROW_I_0_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_ROW_I_0_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_0_GPIO_SEL_POS)
#define PDS_CFG_KEY_ROW_I_0_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_ROW_I_0_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_0_GPIO_SEL_POS))
#define PDS_CFG_KEY_ROW_I_1_GPIO_SEL                            PDS_CFG_KEY_ROW_I_1_GPIO_SEL
#define PDS_CFG_KEY_ROW_I_1_GPIO_SEL_POS                        (8U)
#define PDS_CFG_KEY_ROW_I_1_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_ROW_I_1_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_ROW_I_1_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_1_GPIO_SEL_POS)
#define PDS_CFG_KEY_ROW_I_1_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_ROW_I_1_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_1_GPIO_SEL_POS))
#define PDS_CFG_KEY_ROW_I_2_GPIO_SEL                            PDS_CFG_KEY_ROW_I_2_GPIO_SEL
#define PDS_CFG_KEY_ROW_I_2_GPIO_SEL_POS                        (16U)
#define PDS_CFG_KEY_ROW_I_2_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_ROW_I_2_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_ROW_I_2_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_2_GPIO_SEL_POS)
#define PDS_CFG_KEY_ROW_I_2_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_ROW_I_2_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_2_GPIO_SEL_POS))
#define PDS_CFG_KEY_ROW_I_3_GPIO_SEL                            PDS_CFG_KEY_ROW_I_3_GPIO_SEL
#define PDS_CFG_KEY_ROW_I_3_GPIO_SEL_POS                        (24U)
#define PDS_CFG_KEY_ROW_I_3_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_ROW_I_3_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_ROW_I_3_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_3_GPIO_SEL_POS)
#define PDS_CFG_KEY_ROW_I_3_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_ROW_I_3_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_3_GPIO_SEL_POS))
#define PDS_CFG_ROW_DETECT_CNT                                  PDS_CFG_ROW_DETECT_CNT
#define PDS_CFG_ROW_DETECT_CNT_POS                              (29U)
#define PDS_CFG_ROW_DETECT_CNT_LEN                              (3U)
#define PDS_CFG_ROW_DETECT_CNT_MSK                              (((1U<<PDS_CFG_ROW_DETECT_CNT_LEN)-1)<<PDS_CFG_ROW_DETECT_CNT_POS)
#define PDS_CFG_ROW_DETECT_CNT_UMSK                             (~(((1U<<PDS_CFG_ROW_DETECT_CNT_LEN)-1)<<PDS_CFG_ROW_DETECT_CNT_POS))

/* 0x64 : KYS_ROW_I_GPIO_SEL1 */
#define PDS_KYS_ROW_I_GPIO_SEL1_OFFSET                          (0x64)
#define PDS_CFG_KEY_ROW_I_4_GPIO_SEL                            PDS_CFG_KEY_ROW_I_4_GPIO_SEL
#define PDS_CFG_KEY_ROW_I_4_GPIO_SEL_POS                        (0U)
#define PDS_CFG_KEY_ROW_I_4_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_ROW_I_4_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_ROW_I_4_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_4_GPIO_SEL_POS)
#define PDS_CFG_KEY_ROW_I_4_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_ROW_I_4_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_4_GPIO_SEL_POS))
#define PDS_CFG_KEY_ROW_I_5_GPIO_SEL                            PDS_CFG_KEY_ROW_I_5_GPIO_SEL
#define PDS_CFG_KEY_ROW_I_5_GPIO_SEL_POS                        (8U)
#define PDS_CFG_KEY_ROW_I_5_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_ROW_I_5_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_ROW_I_5_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_5_GPIO_SEL_POS)
#define PDS_CFG_KEY_ROW_I_5_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_ROW_I_5_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_5_GPIO_SEL_POS))
#define PDS_CFG_KEY_ROW_I_6_GPIO_SEL                            PDS_CFG_KEY_ROW_I_6_GPIO_SEL
#define PDS_CFG_KEY_ROW_I_6_GPIO_SEL_POS                        (16U)
#define PDS_CFG_KEY_ROW_I_6_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_ROW_I_6_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_ROW_I_6_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_6_GPIO_SEL_POS)
#define PDS_CFG_KEY_ROW_I_6_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_ROW_I_6_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_6_GPIO_SEL_POS))
#define PDS_CFG_KEY_ROW_I_7_GPIO_SEL                            PDS_CFG_KEY_ROW_I_7_GPIO_SEL
#define PDS_CFG_KEY_ROW_I_7_GPIO_SEL_POS                        (24U)
#define PDS_CFG_KEY_ROW_I_7_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_ROW_I_7_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_ROW_I_7_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_7_GPIO_SEL_POS)
#define PDS_CFG_KEY_ROW_I_7_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_ROW_I_7_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_ROW_I_7_GPIO_SEL_POS))

/* 0x68 : KYS_COL_O_GPIO_SEL0 */
#define PDS_KYS_COL_O_GPIO_SEL0_OFFSET                          (0x68)
#define PDS_CFG_KEY_COL_O_0_GPIO_SEL                            PDS_CFG_KEY_COL_O_0_GPIO_SEL
#define PDS_CFG_KEY_COL_O_0_GPIO_SEL_POS                        (0U)
#define PDS_CFG_KEY_COL_O_0_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_COL_O_0_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_COL_O_0_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_0_GPIO_SEL_POS)
#define PDS_CFG_KEY_COL_O_0_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_COL_O_0_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_0_GPIO_SEL_POS))
#define PDS_CFG_KEY_COL_O_1_GPIO_SEL                            PDS_CFG_KEY_COL_O_1_GPIO_SEL
#define PDS_CFG_KEY_COL_O_1_GPIO_SEL_POS                        (8U)
#define PDS_CFG_KEY_COL_O_1_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_COL_O_1_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_COL_O_1_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_1_GPIO_SEL_POS)
#define PDS_CFG_KEY_COL_O_1_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_COL_O_1_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_1_GPIO_SEL_POS))
#define PDS_CFG_KEY_COL_O_2_GPIO_SEL                            PDS_CFG_KEY_COL_O_2_GPIO_SEL
#define PDS_CFG_KEY_COL_O_2_GPIO_SEL_POS                        (16U)
#define PDS_CFG_KEY_COL_O_2_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_COL_O_2_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_COL_O_2_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_2_GPIO_SEL_POS)
#define PDS_CFG_KEY_COL_O_2_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_COL_O_2_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_2_GPIO_SEL_POS))
#define PDS_CFG_KEY_COL_O_3_GPIO_SEL                            PDS_CFG_KEY_COL_O_3_GPIO_SEL
#define PDS_CFG_KEY_COL_O_3_GPIO_SEL_POS                        (24U)
#define PDS_CFG_KEY_COL_O_3_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_COL_O_3_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_COL_O_3_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_3_GPIO_SEL_POS)
#define PDS_CFG_KEY_COL_O_3_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_COL_O_3_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_3_GPIO_SEL_POS))

/* 0x6C : KYS_COL_O_GPIO_SEL1 */
#define PDS_KYS_COL_O_GPIO_SEL1_OFFSET                          (0x6C)
#define PDS_CFG_KEY_COL_O_4_GPIO_SEL                            PDS_CFG_KEY_COL_O_4_GPIO_SEL
#define PDS_CFG_KEY_COL_O_4_GPIO_SEL_POS                        (0U)
#define PDS_CFG_KEY_COL_O_4_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_COL_O_4_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_COL_O_4_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_4_GPIO_SEL_POS)
#define PDS_CFG_KEY_COL_O_4_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_COL_O_4_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_4_GPIO_SEL_POS))
#define PDS_CFG_KEY_COL_O_5_GPIO_SEL                            PDS_CFG_KEY_COL_O_5_GPIO_SEL
#define PDS_CFG_KEY_COL_O_5_GPIO_SEL_POS                        (8U)
#define PDS_CFG_KEY_COL_O_5_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_COL_O_5_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_COL_O_5_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_5_GPIO_SEL_POS)
#define PDS_CFG_KEY_COL_O_5_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_COL_O_5_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_5_GPIO_SEL_POS))
#define PDS_CFG_KEY_COL_O_6_GPIO_SEL                            PDS_CFG_KEY_COL_O_6_GPIO_SEL
#define PDS_CFG_KEY_COL_O_6_GPIO_SEL_POS                        (16U)
#define PDS_CFG_KEY_COL_O_6_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_COL_O_6_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_COL_O_6_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_6_GPIO_SEL_POS)
#define PDS_CFG_KEY_COL_O_6_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_COL_O_6_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_6_GPIO_SEL_POS))
#define PDS_CFG_KEY_COL_O_7_GPIO_SEL                            PDS_CFG_KEY_COL_O_7_GPIO_SEL
#define PDS_CFG_KEY_COL_O_7_GPIO_SEL_POS                        (24U)
#define PDS_CFG_KEY_COL_O_7_GPIO_SEL_LEN                        (5U)
#define PDS_CFG_KEY_COL_O_7_GPIO_SEL_MSK                        (((1U<<PDS_CFG_KEY_COL_O_7_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_7_GPIO_SEL_POS)
#define PDS_CFG_KEY_COL_O_7_GPIO_SEL_UMSK                       (~(((1U<<PDS_CFG_KEY_COL_O_7_GPIO_SEL_LEN)-1)<<PDS_CFG_KEY_COL_O_7_GPIO_SEL_POS))


