bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/pds_reg.h
struct  pds_reg {
    /* 0x0 : PDS_CTL */
    union {
        struct {
            uint32_t pds_start_ps                   :  1; /* [    0],        w1p,        0x0 */
            uint32_t cr_sleep_forever               :  1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2                     :  1; /* [    2],       rsvd,        0x0 */
            uint32_t cr_pds_wait_rc32m_rdy          :  1; /* [    3],        r/w,        0x0 */
            uint32_t cr_pds_pd_avdd14               :  1; /* [    4],        r/w,        0x0 */
            uint32_t cr_pds_pd_bg_sys               :  1; /* [    5],        r/w,        0x0 */
            uint32_t cr_pds_glb_reg_reset_protect   :  1; /* [    6],        r/w,        0x0 */
            uint32_t cr_pds_ctrl_pu_flash           :  1; /* [    7],        r/w,        0x0 */
            uint32_t cr_pds_gate_clk                :  1; /* [    8],        r/w,        0x1 */
            uint32_t cr_pds_mem_stby                :  1; /* [    9],        r/w,        0x1 */
            uint32_t cr_sw_pu_flash                 :  1; /* [   10],        r/w,        0x1 */
            uint32_t cr_pds_iso_en                  :  1; /* [   11],        r/w,        0x1 */
            uint32_t cr_pds_wait_xtal_rdy           :  1; /* [   12],        r/w,        0x0 */
            uint32_t cr_pds_pwr_off                 :  1; /* [   13],        r/w,        0x1 */
            uint32_t cr_pds_pd_xtal                 :  1; /* [   14],        r/w,        0x1 */
            uint32_t cr_pds_ctrl_soc_enb            :  1; /* [   15],        r/w,        0x0 */
            uint32_t cr_pds_rst_soc_en              :  1; /* [   16],        r/w,        0x0 */
            uint32_t cr_pds_rc32m_off_dis           :  1; /* [   17],        r/w,        0x0 */
            uint32_t cr_pds_ldo_vsel_en             :  1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t cr_pds_xtal_cnt_rc32k_en       :  1; /* [   20],        r/w,        0x0 */
            uint32_t cr_np_wfi_mask                 :  1; /* [   21],        r/w,        0x0 */
            uint32_t cr_pds_pd_ldo11                :  1; /* [   22],        r/w,        0x0 */
            uint32_t cr_pds_ctrl_rf                 :  1; /* [   23],        r/w,        0x0 */
            uint32_t cfg_xtal_deg_en                :  1; /* [   24],        r/w,        0x0 */
            uint32_t cfg_ble_wakeup_req_after_pds   :  1; /* [   25],        r/w,        0x0 */
            uint32_t cr_sw_gpio_iso_mode            :  1; /* [   26],        r/w,        0x0 */
            uint32_t cr_turn_off_pds_clk            :  1; /* [   27],        r/w,        0x1 */
            uint32_t cr_pds_gpio_keep_en            :  3; /* [30:28],        r/w,        0x7 */
            uint32_t cr_pds_gpio_iso_mode           :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } PDS_CTL;

    /* 0x4  reserved */
    uint8_t RESERVED0x4[8];

    /* 0xC : PDS_INT */
    union {
        struct {
            uint32_t ro_pds_wake_int                :  1; /* [    0],          r,        0x0 */
            uint32_t reserved_1                     :  1; /* [    1],       rsvd,        0x0 */
            uint32_t ro_pds_rf_done_int             :  1; /* [    2],          r,        0x0 */
            uint32_t reserved_3                     :  1; /* [    3],       rsvd,        0x0 */
            uint32_t pds_reset_event                :  3; /* [ 6: 4],          r,        0x0 */
            uint32_t pds_clr_reset_event            :  1; /* [    7],          w,        0x0 */
            uint32_t cr_pds_wake_int_mask           :  1; /* [    8],        r/w,        0x0 */
            uint32_t pds_pin_wakeup_option          :  1; /* [    9],        r/w,        0x0 */
            uint32_t cr_pds_rf_done_int_mask        :  1; /* [   10],        r/w,        0x0 */
            uint32_t pds_timeout_event              :  3; /* [13:11],          r,        0x0 */
            uint32_t en_pds_timeout_event           :  1; /* [   14],        r/w,        0x0 */
            uint32_t cr_pds_int_clr                 :  1; /* [   15],        w1p,        0x0 */
            uint32_t reserved_16                    :  1; /* [   16],       rsvd,        0x0 */
            uint32_t cr_pds_wakeup_src_en           :  7; /* [23:17],        r/w,       0x7f */
            uint32_t reserved_24                    :  1; /* [   24],       rsvd,        0x0 */
            uint32_t ro_pds_wakeup_event            :  7; /* [31:25],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } PDS_INT;

    /* 0x10 : PDS_CTL2 */
    union {
        struct {
            uint32_t reserved_0_7                   :  8; /* [ 7: 0],       rsvd,        0x0 */
            uint32_t cr_pds_force_np_pds_rst        :  1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9                     :  1; /* [    9],       rsvd,        0x0 */
            uint32_t cr_pds_force_bz_pds_rst        :  1; /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_15                 :  5; /* [15:11],       rsvd,        0x0 */
            uint32_t cr_pds_force_np_gate_clk       :  1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17                    :  1; /* [   17],       rsvd,        0x0 */
            uint32_t cr_pds_force_bz_gate_clk       :  1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_31                 : 13; /* [31:19],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } PDS_CTL2;

    /* 0x14 : PDS_CTL3 */
    union {
        struct {
            uint32_t reserved_0                     :  1; /* [    0],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_pwr_off      :  1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_6                   :  5; /* [ 6: 2],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_pds_rst      :  1; /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_12                  :  5; /* [12: 8],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_gate_clk     :  1; /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_29                 : 16; /* [29:14],       rsvd,        0x0 */
            uint32_t cr_pds_misc_iso_en             :  1; /* [   30],        r/w,        0x1 */
            uint32_t reserved_31                    :  1; /* [   31],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } PDS_CTL3;

    /* 0x18 : PDS_CTL4 */
    union {
        struct {
            uint32_t reserved_0                     :  1; /* [    0],       rsvd,        0x0 */
            uint32_t cr_pds_np_reset                :  1; /* [    1],        r/w,        0x1 */
            uint32_t reserved_2                     :  1; /* [    2],       rsvd,        0x0 */
            uint32_t cr_pds_np_gate_clk             :  1; /* [    3],        r/w,        0x1 */
            uint32_t reserved_4_12                  :  9; /* [12: 4],       rsvd,        0x0 */
            uint32_t cr_pds_bz_reset                :  1; /* [   13],        r/w,        0x1 */
            uint32_t reserved_14                    :  1; /* [   14],       rsvd,        0x0 */
            uint32_t cr_pds_bz_gate_clk             :  1; /* [   15],        r/w,        0x1 */
            uint32_t reserved_16_23                 :  8; /* [23:16],       rsvd,        0x0 */
            uint32_t cr_pds_misc_pwr_off            :  1; /* [   24],        r/w,        0x1 */
            uint32_t cr_pds_misc_reset              :  1; /* [   25],        r/w,        0x1 */
            uint32_t reserved_26                    :  1; /* [   26],       rsvd,        0x0 */
            uint32_t cr_pds_misc_gate_clk           :  1; /* [   27],        r/w,        0x1 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } PDS_CTL4;

    /* 0x1C : pds_stat */
    union {
        struct {
            uint32_t ro_pds_state                   :  5; /* [ 4: 0],          r,        0x0 */
            uint32_t reserved_5_7                   :  3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t ro_pds_rf_state                :  3; /* [10: 8],          r,        0x0 */
            uint32_t reserved_11_31                 : 21; /* [31:11],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } pds_stat;

    /* 0x20 : pds_ram1 */
    union {
        struct {
            uint32_t cr_pds_ram_ret1n               :  5; /* [ 4: 0],        r/w,       0x1f */
            uint32_t reserved_5_7                   :  3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t cr_pds_ram_ret2n               :  5; /* [12: 8],        r/w,        0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t cr_pds_ram_pgen                :  5; /* [20:16],        r/w,        0x0 */
            uint32_t reserved_21_31                 : 11; /* [31:21],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } pds_ram1;

    /* 0x24  reserved */
    uint8_t RESERVED0x24[12];

