bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/pds_reg.h
    /* 0x30 : pds_gpio_pd_set */
    union {
        struct {
            uint32_t cr_pds_gpio0_pd                :  1; /* [    0],        r/w,        0x0 */
            uint32_t cr_pds_gpio1_pd                :  1; /* [    1],        r/w,        0x0 */
            uint32_t cr_pds_gpio2_pd                :  1; /* [    2],        r/w,        0x0 */
            uint32_t cr_pds_gpio3_pd                :  1; /* [    3],        r/w,        0x0 */
            uint32_t cr_pds_gpio4_pd                :  1; /* [    4],          r,        0x0 */
            uint32_t cr_pds_gpio5_pd                :  1; /* [    5],          r,        0x0 */
            uint32_t cr_pds_gpio6_pd                :  1; /* [    6],          r,        0x0 */
            uint32_t cr_pds_gpio7_pd                :  1; /* [    7],        r/w,        0x0 */
            uint32_t cr_pds_gpio8_pd                :  1; /* [    8],        r/w,        0x0 */
            uint32_t cr_pds_gpio9_pd                :  1; /* [    9],          r,        0x0 */
            uint32_t cr_pds_gpio10_pd               :  1; /* [   10],          r,        0x0 */
            uint32_t cr_pds_gpio11_pd               :  1; /* [   11],          r,        0x0 */
            uint32_t cr_pds_gpio12_pd               :  1; /* [   12],          r,        0x0 */
            uint32_t cr_pds_gpio13_pd               :  1; /* [   13],          r,        0x0 */
            uint32_t cr_pds_gpio14_pd               :  1; /* [   14],        r/w,        0x0 */
            uint32_t cr_pds_gpio15_pd               :  1; /* [   15],        r/w,        0x0 */
            uint32_t cr_pds_gpio16_pd               :  1; /* [   16],        r/w,        0x0 */
            uint32_t cr_pds_gpio17_pd               :  1; /* [   17],        r/w,        0x0 */
            uint32_t cr_pds_gpio18_pd               :  1; /* [   18],        r/w,        0x0 */
            uint32_t cr_pds_gpio19_pd               :  1; /* [   19],        r/w,        0x0 */
            uint32_t cr_pds_gpio20_pd               :  1; /* [   20],        r/w,        0x0 */
            uint32_t cr_pds_gpio21_pd               :  1; /* [   21],        r/w,        0x0 */
            uint32_t cr_pds_gpio22_pd               :  1; /* [   22],        r/w,        0x0 */
            uint32_t cr_pds_gpio23_pd               :  1; /* [   23],        r/w,        0x0 */
            uint32_t cr_pds_gpio24_pd               :  1; /* [   24],        r/w,        0x0 */
            uint32_t cr_pds_gpio25_pd               :  1; /* [   25],        r/w,        0x0 */
            uint32_t cr_pds_gpio26_pd               :  1; /* [   26],        r/w,        0x0 */
            uint32_t cr_pds_gpio27_pd               :  1; /* [   27],        r/w,        0x0 */
            uint32_t cr_pds_gpio28_pd               :  1; /* [   28],        r/w,        0x0 */
            uint32_t cr_pds_gpio29_pd               :  1; /* [   29],        r/w,        0x0 */
            uint32_t cr_pds_gpio30_pd               :  1; /* [   30],          r,        0x0 */
            uint32_t cr_pds_gpio31_pd               :  1; /* [   31],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } pds_gpio_pd_set;

    /* 0x34 : pds_gpio_pu_set */
    union {
        struct {
            uint32_t cr_pds_gpio0_pu                :  1; /* [    0],        r/w,        0x0 */
            uint32_t cr_pds_gpio1_pu                :  1; /* [    1],        r/w,        0x0 */
            uint32_t cr_pds_gpio2_pu                :  1; /* [    2],        r/w,        0x0 */
            uint32_t cr_pds_gpio3_pu                :  1; /* [    3],        r/w,        0x0 */
            uint32_t cr_pds_gpio4_pu                :  1; /* [    4],          r,        0x0 */
            uint32_t cr_pds_gpio5_pu                :  1; /* [    5],          r,        0x0 */
            uint32_t cr_pds_gpio6_pu                :  1; /* [    6],          r,        0x0 */
            uint32_t cr_pds_gpio7_pu                :  1; /* [    7],        r/w,        0x0 */
            uint32_t cr_pds_gpio8_pu                :  1; /* [    8],        r/w,        0x0 */
            uint32_t cr_pds_gpio9_pu                :  1; /* [    9],          r,        0x0 */
            uint32_t cr_pds_gpio10_pu               :  1; /* [   10],          r,        0x0 */
            uint32_t cr_pds_gpio11_pu               :  1; /* [   11],          r,        0x0 */
            uint32_t cr_pds_gpio12_pu               :  1; /* [   12],          r,        0x0 */
            uint32_t cr_pds_gpio13_pu               :  1; /* [   13],          r,        0x0 */
            uint32_t cr_pds_gpio14_pu               :  1; /* [   14],        r/w,        0x0 */
            uint32_t cr_pds_gpio15_pu               :  1; /* [   15],        r/w,        0x0 */
            uint32_t cr_pds_gpio16_pu               :  1; /* [   16],        r/w,        0x0 */
            uint32_t cr_pds_gpio17_pu               :  1; /* [   17],        r/w,        0x0 */
            uint32_t cr_pds_gpio18_pu               :  1; /* [   18],        r/w,        0x0 */
            uint32_t cr_pds_gpio19_pu               :  1; /* [   19],        r/w,        0x0 */
            uint32_t cr_pds_gpio20_pu               :  1; /* [   20],        r/w,        0x0 */
            uint32_t cr_pds_gpio21_pu               :  1; /* [   21],        r/w,        0x0 */
            uint32_t cr_pds_gpio22_pu               :  1; /* [   22],        r/w,        0x0 */
            uint32_t cr_pds_gpio23_pu               :  1; /* [   23],        r/w,        0x0 */
            uint32_t cr_pds_gpio24_pu               :  1; /* [   24],        r/w,        0x0 */
            uint32_t cr_pds_gpio25_pu               :  1; /* [   25],        r/w,        0x0 */
            uint32_t cr_pds_gpio26_pu               :  1; /* [   26],        r/w,        0x0 */
            uint32_t cr_pds_gpio27_pu               :  1; /* [   27],        r/w,        0x0 */
            uint32_t cr_pds_gpio28_pu               :  1; /* [   28],        r/w,        0x0 */
            uint32_t cr_pds_gpio29_pu               :  1; /* [   29],        r/w,        0x0 */
            uint32_t cr_pds_gpio30_pu               :  1; /* [   30],          r,        0x0 */
            uint32_t cr_pds_gpio31_pu               :  1; /* [   31],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } pds_gpio_pu_set;

