bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/pds_reg.h
    /* 0x38 : pds_gpio_ie_set */
    union {
        struct {
            uint32_t cr_pds_gpio0_ie                :  1; /* [    0],        r/w,        0x0 */
            uint32_t cr_pds_gpio1_ie                :  1; /* [    1],        r/w,        0x0 */
            uint32_t cr_pds_gpio2_ie                :  1; /* [    2],        r/w,        0x0 */
            uint32_t cr_pds_gpio3_ie                :  1; /* [    3],        r/w,        0x0 */
            uint32_t cr_pds_gpio4_ie                :  1; /* [    4],          r,        0x0 */
            uint32_t cr_pds_gpio5_ie                :  1; /* [    5],          r,        0x0 */
            uint32_t cr_pds_gpio6_ie                :  1; /* [    6],          r,        0x0 */
            uint32_t cr_pds_gpio7_ie                :  1; /* [    7],        r/w,        0x0 */
            uint32_t cr_pds_gpio8_ie                :  1; /* [    8],        r/w,        0x0 */
            uint32_t cr_pds_gpio9_ie                :  1; /* [    9],          r,        0x0 */
            uint32_t cr_pds_gpio10_ie               :  1; /* [   10],          r,        0x0 */
            uint32_t cr_pds_gpio11_ie               :  1; /* [   11],          r,        0x0 */
            uint32_t cr_pds_gpio12_ie               :  1; /* [   12],          r,        0x0 */
            uint32_t cr_pds_gpio13_ie               :  1; /* [   13],          r,        0x0 */
            uint32_t cr_pds_gpio14_ie               :  1; /* [   14],        r/w,        0x0 */
            uint32_t cr_pds_gpio15_ie               :  1; /* [   15],        r/w,        0x0 */
            uint32_t cr_pds_gpio16_ie               :  1; /* [   16],        r/w,        0x0 */
            uint32_t cr_pds_gpio17_ie               :  1; /* [   17],        r/w,        0x0 */
            uint32_t cr_pds_gpio18_ie               :  1; /* [   18],        r/w,        0x0 */
            uint32_t cr_pds_gpio19_ie               :  1; /* [   19],        r/w,        0x0 */
            uint32_t cr_pds_gpio20_ie               :  1; /* [   20],        r/w,        0x0 */
            uint32_t cr_pds_gpio21_ie               :  1; /* [   21],        r/w,        0x0 */
            uint32_t cr_pds_gpio22_ie               :  1; /* [   22],        r/w,        0x0 */
            uint32_t cr_pds_gpio23_ie               :  1; /* [   23],        r/w,        0x0 */
            uint32_t cr_pds_gpio24_ie               :  1; /* [   24],        r/w,        0x0 */
            uint32_t cr_pds_gpio25_ie               :  1; /* [   25],        r/w,        0x0 */
            uint32_t cr_pds_gpio26_ie               :  1; /* [   26],        r/w,        0x0 */
            uint32_t cr_pds_gpio27_ie               :  1; /* [   27],        r/w,        0x0 */
            uint32_t cr_pds_gpio28_ie               :  1; /* [   28],        r/w,        0x0 */
            uint32_t cr_pds_gpio29_ie               :  1; /* [   29],        r/w,        0x0 */
            uint32_t cr_pds_gpio30_ie               :  1; /* [   30],          r,        0x0 */
            uint32_t cr_pds_gpio31_ie               :  1; /* [   31],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } pds_gpio_ie_set;

    /* 0x3C : pds_gpio_oe_set */
    union {
        struct {
            uint32_t cr_pds_gpio0_oe                :  1; /* [    0],        r/w,        0x0 */
            uint32_t cr_pds_gpio1_oe                :  1; /* [    1],        r/w,        0x0 */
            uint32_t cr_pds_gpio2_oe                :  1; /* [    2],        r/w,        0x0 */
            uint32_t cr_pds_gpio3_oe                :  1; /* [    3],        r/w,        0x0 */
            uint32_t cr_pds_gpio4_oe                :  1; /* [    4],          r,        0x0 */
            uint32_t cr_pds_gpio5_oe                :  1; /* [    5],          r,        0x0 */
            uint32_t cr_pds_gpio6_oe                :  1; /* [    6],          r,        0x0 */
            uint32_t cr_pds_gpio7_oe                :  1; /* [    7],        r/w,        0x0 */
            uint32_t cr_pds_gpio8_oe                :  1; /* [    8],        r/w,        0x0 */
            uint32_t cr_pds_gpio9_oe                :  1; /* [    9],          r,        0x0 */
            uint32_t cr_pds_gpio10_oe               :  1; /* [   10],          r,        0x0 */
            uint32_t cr_pds_gpio11_oe               :  1; /* [   11],          r,        0x0 */
            uint32_t cr_pds_gpio12_oe               :  1; /* [   12],          r,        0x0 */
            uint32_t cr_pds_gpio13_oe               :  1; /* [   13],          r,        0x0 */
            uint32_t cr_pds_gpio14_oe               :  1; /* [   14],        r/w,        0x0 */
            uint32_t cr_pds_gpio15_oe               :  1; /* [   15],        r/w,        0x0 */
            uint32_t cr_pds_gpio16_oe               :  1; /* [   16],        r/w,        0x0 */
            uint32_t cr_pds_gpio17_oe               :  1; /* [   17],        r/w,        0x0 */
            uint32_t cr_pds_gpio18_oe               :  1; /* [   18],        r/w,        0x0 */
            uint32_t cr_pds_gpio19_oe               :  1; /* [   19],        r/w,        0x0 */
            uint32_t cr_pds_gpio20_oe               :  1; /* [   20],        r/w,        0x0 */
            uint32_t cr_pds_gpio21_oe               :  1; /* [   21],        r/w,        0x0 */
            uint32_t cr_pds_gpio22_oe               :  1; /* [   22],        r/w,        0x0 */
            uint32_t cr_pds_gpio23_oe               :  1; /* [   23],        r/w,        0x0 */
            uint32_t cr_pds_gpio24_oe               :  1; /* [   24],        r/w,        0x0 */
            uint32_t cr_pds_gpio25_oe               :  1; /* [   25],        r/w,        0x0 */
            uint32_t cr_pds_gpio26_oe               :  1; /* [   26],        r/w,        0x0 */
            uint32_t cr_pds_gpio27_oe               :  1; /* [   27],        r/w,        0x0 */
            uint32_t cr_pds_gpio28_oe               :  1; /* [   28],        r/w,        0x0 */
            uint32_t cr_pds_gpio29_oe               :  1; /* [   29],        r/w,        0x0 */
            uint32_t cr_pds_gpio30_oe               :  1; /* [   30],          r,        0x0 */
            uint32_t cr_pds_gpio31_oe               :  1; /* [   31],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } pds_gpio_oe_set;

