bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/pds_reg.h
    /* 0x40 : pds_gpio_int_set */
    union {
        struct {
            uint32_t pds_gpio_set0_int_mode         :  4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t pds_gpio_set1_int_mode         :  4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t pds_gpio_set2_int_mode         :  4; /* [11: 8],        r/w,        0x0 */
            uint32_t pds_gpio_set3_int_mode         :  4; /* [15:12],        r/w,        0x0 */
            uint32_t pds_gpio_set4_int_mode         :  4; /* [19:16],        r/w,        0x0 */
            uint32_t pds_gpio_set5_int_mode         :  4; /* [23:20],        r/w,        0x0 */
            uint32_t pds_gpio_set6_int_mode         :  4; /* [27:24],        r/w,        0x0 */
            uint32_t pds_gpio_set7_int_mode         :  4; /* [31:28],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } pds_gpio_int_set;

    /* 0x44 : pds_gpio_stat */
    union {
        struct {
            uint32_t pds_gpio_int_stat              : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } pds_gpio_stat;

    /* 0x48 : cfg_pds_key_scan */
    union {
        struct {
            uint32_t cr_pds_gpio_set_o_val          :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t cr_pds_gpio_set_int_mask       :  8; /* [15: 8],        r/w,       0xff */
            uint32_t reserved_16_23                 :  8; /* [23:16],       rsvd,        0x0 */
            uint32_t cr_pds_gpio0_set_int_clr       :  1; /* [   24],        w1p,        0x0 */
            uint32_t cr_pds_gpio1_set_int_clr       :  1; /* [   25],        w1p,        0x0 */
            uint32_t cr_pds_gpio2_set_int_clr       :  1; /* [   26],        w1p,        0x0 */
            uint32_t cr_pds_gpio3_set_int_clr       :  1; /* [   27],        w1p,        0x0 */
            uint32_t cr_pds_gpio4_set_int_clr       :  1; /* [   28],        w1p,        0x0 */
            uint32_t cr_pds_gpio5_set_int_clr       :  1; /* [   29],        w1p,        0x0 */
            uint32_t cr_pds_gpio6_set_int_clr       :  1; /* [   30],        w1p,        0x0 */
            uint32_t cr_pds_gpio7_set_int_clr       :  1; /* [   31],        w1p,        0x0 */
        }BF;
        uint32_t WORD;
    } cfg_pds_key_scan;

    /* 0x4C : XTAL_CNT_32K */
    union {
        struct {
            uint32_t ro_xtal_cnt_32k_res            :  6; /* [ 5: 0],          r,       0x24 */
            uint32_t ro_xtal_cnt_32k_cnt            : 11; /* [16: 6],          r,      0x3d0 */
            uint32_t reg_total_32k_cycle            :  3; /* [19:17],        r/w,        0x0 */
            uint32_t reserved_20_28                 :  9; /* [28:20],       rsvd,        0x0 */
            uint32_t xtal_cnt_32k_process           :  1; /* [   29],          r,        0x0 */
            uint32_t xtal_cnt_32k_done              :  1; /* [   30],          r,        0x0 */
            uint32_t reserved_31                    :  1; /* [   31],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } XTAL_CNT_32K;

    /* 0x50 : PDS_KYD_CTL */
    union {
        struct {
            uint32_t cr_pds_kyd_en                  :  1; /* [    0],        r/w,        0x0 */
            uint32_t cr_pds_kyd_col_o_val           :  1; /* [    1],        r/w,        0x0 */
            uint32_t cr_pds_kyd_row_matrix_size     :  3; /* [ 4: 2],        r/w,        0x7 */
            uint32_t cr_pds_kyd_col_matrix_size     :  3; /* [ 7: 5],        r/w,        0x7 */
            uint32_t cr_pds_kyd_row_i_pull_en       :  1; /* [    8],        r/w,        0x0 */
            uint32_t ro_pds_kyd_wakeup              :  1; /* [    9],          r,        0x0 */
            uint32_t clr_pds_kyd_wakeup             :  1; /* [   10],        w1p,        0x0 */
            uint32_t reserved_11_15                 :  5; /* [15:11],       rsvd,        0x0 */
            uint32_t ro_pds_kyd_wakeup_row_gpio     :  5; /* [20:16],          r,        0x0 */
            uint32_t ro_pds_kyd_wakeup_row_index    :  3; /* [23:21],          r,        0x0 */
            uint32_t ro_pds_kyd_wakeup_col_gpio     :  5; /* [28:24],          r,        0x0 */
            uint32_t ro_pds_kyd_wakeup_col_index    :  3; /* [31:29],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } PDS_KYD_CTL;

    /* 0x54 : PDS_KYD_WHITE_SET */
    union {
        struct {
            uint32_t cfg_white_key0_row_index       :  3; /* [ 2: 0],        r/w,        0x0 */
            uint32_t cfg_white_key0_col_index       :  3; /* [ 5: 3],        r/w,        0x0 */
            uint32_t cfg_white_key0_kyd_mode        :  2; /* [ 7: 6],        r/w,        0x0 */
            uint32_t cfg_white_key1_row_index       :  3; /* [10: 8],        r/w,        0x0 */
            uint32_t cfg_white_key1_col_index       :  3; /* [13:11],        r/w,        0x0 */
            uint32_t cfg_white_key1_kyd_mode        :  2; /* [15:14],        r/w,        0x0 */
            uint32_t cfg_white_key2_row_index       :  3; /* [18:16],        r/w,        0x0 */
            uint32_t cfg_white_key2_col_index       :  3; /* [21:19],        r/w,        0x0 */
            uint32_t cfg_white_key2_kyd_mode        :  2; /* [23:22],        r/w,        0x0 */
            uint32_t cfg_white_key3_row_index       :  3; /* [26:24],        r/w,        0x0 */
            uint32_t cfg_white_key3_col_index       :  3; /* [29:27],        r/w,        0x0 */
            uint32_t cfg_white_key3_kyd_mode        :  2; /* [31:30],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } PDS_KYD_WHITE_SET;

    /* 0x58  reserved */
    uint8_t RESERVED0x58[8];

    /* 0x60 : KYS_ROW_I_GPIO_SEL0 */
    union {
        struct {
            uint32_t cfg_key_row_i_0_gpio_sel       :  5; /* [ 4: 0],        r/w,        0x0 */
            uint32_t reserved_5_7                   :  3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t cfg_key_row_i_1_gpio_sel       :  5; /* [12: 8],        r/w,        0x1 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t cfg_key_row_i_2_gpio_sel       :  5; /* [20:16],        r/w,        0x2 */
            uint32_t reserved_21_23                 :  3; /* [23:21],       rsvd,        0x0 */
            uint32_t cfg_key_row_i_3_gpio_sel       :  5; /* [28:24],        r/w,        0x3 */
            uint32_t cfg_row_detect_cnt             :  3; /* [31:29],        r/w,        0x4 */
        }BF;
        uint32_t WORD;
    } KYS_ROW_I_GPIO_SEL0;

    /* 0x64 : KYS_ROW_I_GPIO_SEL1 */
    union {
        struct {
            uint32_t cfg_key_row_i_4_gpio_sel       :  5; /* [ 4: 0],        r/w,        0x4 */
            uint32_t reserved_5_7                   :  3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t cfg_key_row_i_5_gpio_sel       :  5; /* [12: 8],        r/w,        0x5 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t cfg_key_row_i_6_gpio_sel       :  5; /* [20:16],        r/w,        0x6 */
            uint32_t reserved_21_23                 :  3; /* [23:21],       rsvd,        0x0 */
            uint32_t cfg_key_row_i_7_gpio_sel       :  5; /* [28:24],        r/w,        0x7 */
            uint32_t reserved_29_31                 :  3; /* [31:29],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } KYS_ROW_I_GPIO_SEL1;

    /* 0x68 : KYS_COL_O_GPIO_SEL0 */
    union {
        struct {
            uint32_t cfg_key_col_o_0_gpio_sel       :  5; /* [ 4: 0],        r/w,        0x8 */
            uint32_t reserved_5_7                   :  3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t cfg_key_col_o_1_gpio_sel       :  5; /* [12: 8],        r/w,        0x9 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t cfg_key_col_o_2_gpio_sel       :  5; /* [20:16],        r/w,        0xa */
            uint32_t reserved_21_23                 :  3; /* [23:21],       rsvd,        0x0 */
            uint32_t cfg_key_col_o_3_gpio_sel       :  5; /* [28:24],        r/w,        0xb */
            uint32_t reserved_29_31                 :  3; /* [31:29],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } KYS_COL_O_GPIO_SEL0;

    /* 0x6C : KYS_COL_O_GPIO_SEL1 */
    union {
        struct {
            uint32_t cfg_key_col_o_4_gpio_sel       :  5; /* [ 4: 0],        r/w,        0xc */
            uint32_t reserved_5_7                   :  3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t cfg_key_col_o_5_gpio_sel       :  5; /* [12: 8],        r/w,        0xd */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t cfg_key_col_o_6_gpio_sel       :  5; /* [20:16],        r/w,        0xe */
            uint32_t reserved_21_23                 :  3; /* [23:21],       rsvd,        0x0 */
            uint32_t cfg_key_col_o_7_gpio_sel       :  5; /* [28:24],        r/w,        0xf */
            uint32_t reserved_29_31                 :  3; /* [31:29],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } KYS_COL_O_GPIO_SEL1;

};

typedef volatile struct pds_reg pds_reg_t;


#endif  /* __PDS_REG_H__ */
